{
   "currentmaps":[
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap1.JPG",
         "name":"SANDTOWN",
         "info":"General Information:\n   Sandtown is a standard map in Arsenal. The map takes place in a Middle Eastern market district. It is the second smallest map in the game, with Bridge being the smallest.\nThere are planks connecting buildings and roofs to buildings. On ground level, it features a fountain in the heart of the map, narrow pathways leading the buildings, and a wide and open space, making it not much of a hassle to find the action. It also features a little shack containing hay, ways to get up to the buildings as mentioned earlier, and the carpeted inside of the buildings.\nShortly after the start of a round on this map, a scripted event occurs in which a plane crashes into the tallest building on the map, with its right wing falling off and bridging the balcony near the bottom of the building with a nearby staircase. The plane can then be reached by Rocket/Recoil Jumping.\nOn the other two buildings, they have a metallic plank (aka. the plane's wing) connecting them, and a staircase leading up to one of them. Also, it features a stone arch which leads to another part of the map where there is a little plank leading to the other side, a way into one of the carpeted buildings, and more. One spawn point is wide open to players ready to shoot at you.\nThere all sorts of chokepoints, including the area underneath the crashed airplane to the left rooftop of the building left of the wires.\n Tips and Tricks: \n    Sandtown, being one of the smallest maps in the game, means there will always be a firefight somewhere on the map, no exceptions. With constantly shifting spawns, bullets flying from every corner, this map promises never-ending action gameplay.\nSpawns are likely to shift at any given moment and pay attention to where your teammates are heading and figure out where the enemy is going to come from next.\nWhile heights are often a huge advantage in other maps, in Sandtown, it is relevant. The small map size means that the enemy could come from anywhere. The only option is to stay on your toes and eliminate anybody who crosses your path.\nExplosives and shotguns are useful on this map. Enemies are likely to press their faces against the camera or bunch up constantly, so take advantage of those situations!\nThe plane is a viable camping spot, but as stated before, you're likely to either fall behind or get picked off.\nYou can walk on the clotheslines by platforming on the arch near the building spawn. While it might not be too useful, since it leaves you open, it's good if your opponents are focused on where your teammates are. Flank them and secure kills.\nThe Golden Knife is extremely dangerous in this map, since the wielder can quite literally jump from anywhere with its double jump capability. It has many parkour queues. If you happen to get your hands on it, platform onto a higher spot and get the drop on an unsuspecting enemy. Preferably, a rooftop.\nThe middle of the map is usually where the fights go on play, go seek for higher heights to not be part of it.\nThe building that looks over the entire center of the map can easily be ambushed if you fail to keep track of the stairs. Check the route on the side to quickly deal with flankers."
      },
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap2.JPG",
         "name":"SAFEHOUSE",
         "info":"Map Information: \n   Safehouse takes place in a hilly woodland area with a craftsman styled house as the focal point. The map is inspired by the CS:GO map, de_safehouse, but has a different layout outside of the house.\nMultiple rocks, rocky terrain, and trees make it a extremely dynamic map, providing natural cover or vantage points. A cobblestone wall blocks the two sides of the map, however there are some ways around it, with there being a shed that you can climb over to get to the other side, and a 2 planks on the other. \n Tips and Tricks: \n Safehouse is the most straight forward map of all of the maps. With an open spawn area and a closed house area, a skirmish is likely always happening on this map.\nMost players will try to get as many kills as possible going through the main hallway and the kitchen. If you want to get the drop on them, go through one of the windows and flank.\nThe roof is a very strong vantage point, especially if the enemy is spawning in the lower spawns. If you get there, exploit it to its fullest potential.\nIf you want to avoid the house in its entirety, go to the walls and use the planks to flank the enemy.\nThe lower spawn is possibly the worst area to be in on this map. It is, quite literally, an uphill battle from there. Work with your team to push and regain the upper spawn, then turn the tables!\nThe stairs are a nice section to camp on if the enemy is spawning from the upper spawns. Since most of them will be looking down the hallway, pick off any unfortunate souls, then book it once you start getting shot at.\nThe roof, the trees, and the large window on upper-spawn side of the house can be used to get the drop on anybody walking into the hallway. This is especially useful when you're on the Golden Knife.\nWhich is that you're likely to have a hard time getting a kill on this map unless the person you're chasing is inside the house. Use any of the flank routes mentioned above, and win!"
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap3.JPG",
         "name":"AGENCY",
         "info":"General Information:\n   Agency is a map originally from Counter-Strike: Global Offensive as a hostage map. It takes place in a commercial penthouse ontop of a skyscraper. The interior is a two-floor office. The first floor has a giant, open lobby with stairs leading up to the second floor, along with two hallways leading to a small cafeteria and a large space. Said large space is overlooked by a balcony.\n   On the second floor, the stairs from the lobby lead into an office space, which connects via an upstairs balcony-way to the main offices. The main offices contains a conference room, a janitor closet, and workspaces.\n   Agency has multiple windows on the second-floor main office, though they do not have glass, unlike its origin, Counter Blox. Falling off the map causes the player to lose a level since it is an environmental kill.\n   Around the map are several colored balls. The colors of these balls include red, yellow, green, blue, purple, and pink.\n Tips and Tricks:\n   Agency is a map with many rooms, and action happening at every corner. How do you survive?\n   The map is mainly suited for close-quarters, up-close and personal combat.\n   Explosive-weapons such as the M16A2 are extremely devastating at close range: With hardly any room to maneuver in such tight space, a single blast could kill multiple players in one shot.\n   Shotguns also find their niche here, with their capability to fill a narrow, tight space with dozens of pellets in a second.\n   If you climb up the staircase in the room that leads outside, you can find some small openings to shoot through."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap4.JPG",
         "name":"DIZZY",
         "info":"General Information:\n   Dizzy is a map in Arsenal, and can be played in all gamemodes with the exception of Brickbattle and Laser Mania. It's also locked to 2 teams, and cannot be played in 4 teams or FFA, even if they're voted for.\n   Dizzy takes place to be set on top of a tall building undergoing construction at the top, with two identical (save for color) main buildings separated by a lower tunnel, ladders, and a large bundle of wood able to be traversed upon.\n   Falling off of the building will result in dying and losing a level, just like any other map hazard. It is one of the smallest maps in the game, only overshadowed by Sandtown and Bridge.\n   It is possible to reach the top of the crane either using the DBS's, Barrett's or DB Shotgun's recoil jump ability, or a rocket jump. However, rocket jumping on the crane can be harder.\n Tips and Tricks:\n   Dizzy is an easy map to memorize, being near-perfectly symmetrical and straightforward. Most skirmishes will occur in the center area between the two buildings above the basement. Since the spawns aren't that far apart, they swap frequently. Please watch your back.\n   This map has few checkpoints, so there are few options when it comes to flanking. The basement is often forgotten, however, so use it to sneak behind the enemy lines and secure several kills when possible.\n   The small house is a particularly strange spot, as it can be your best friend or your greatest enemy. The secluded area leaves your enemies quite literally small windows to damage you. However, you are very, very susceptible to explosions within it. If someone happens to enter, try to demote them using your knife, as there's little room to run for them.\n   The crane is another strange spot. While it might be ideal for camping, it's absurd height makes it not so ideal. However, this spot is a killer in Clown Infection, make your way up there and escape the horde!\n   The roofs of both of the buildings are good vantage points, especially when there are fewer players around. However, you are at risk for an attack from behind, since the roofs are rather close to one of the main spawns, be careful!\n   The ladders are an often overlooked place to secure kills. People tend to forget they are being shot at when climbing one, so take advantage.\n   Since the map is so small, the Golden Knife has its own advantages and disadvantages depending on placement. Out of spawn, it's extremely likely you'll be killed before you can even get close, considering the map size. However, if you manage to move well, you can easily snag a kill, as the enemies will most likely be distracted by the center skirmish.\n   If you happen to knock someone off the map with an explosive weapon, focus on someone else as the other person falls.\n   If you spawn on the bridge section, be mindful of where you're going. A common mistake with players who want to get to the front lines quickly is accidentally walking off the bridge and losing a level.\n   There is also another secret where you can shotgun jump onto the top of the crane and see multiple lines of texts inside.\n   If you fall off the map, but have an explosive weapon that can rocket jump, or a DBS and DB Shotgun, hug the wall and shoot below your feet. Hugging the wall will cause you to fall slower, and allows you to rocket jump as well.\n   It's fairly easy to predict spawns. If most of your team are on one side of the map, the enemy will likely spawn on the other side."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap5.JPG",
         "name":"ASSAULT",
         "info":"Map Information:\n   Assault is a recreated version of the popular CS:GO and CS Source map known as: cs_assault. It takes place around an industrial warehouse, with access to the area being blocked off. It's separated into 5 distinct parts, the train station, the warehouse on the left side of the map, the two parallel streets next to them, and the long street that connects the warehouse and the parallel streets.\n   The Warehouse has an upper section and a lower section. The upper section has a door in the back that leads to one of the parallel streets, and there is also a door in the lower section that leads to the same street. There is a larger warehouse door that leads to the long street.\n   The Train Station is positioned above the rest of the landmarks, making it a good place to camp.\n   The two parallel streets just lead onto the main connecting road. People will spawn at the end of these roads, so it's nice to dip around and shoot some of them. The two parallel roads are connected by a small alleyway that houses a few trash bags and broken cars.\n   The main street connects all of the previous landmarks. You can enter the warehouse, go onto either of the two parallel streets and walk up to the train station. There aren't any decent barricades on this street, and makes you slightly easier to hit.\n Tips and Tricks:\n   A map straighter than a railgun shot, choked by a small garage, accented by a stocked warehouse, and tied into a knot of endless firefight with the trademark train station, Assault is a map that has two simple states of combat: constant straight shooting chaos, or hilariously one-sided vantage pushes. Considering that most matches in Arsenal aren't that coordinated, you can count on the first happening most of the time.\n   Many weapons that have tight spread and good accuracy are extremely powerful in this map due to the amount of open space and straight sightlines. Snipers are also considerably more useful than normal thanks to this, allowing potentially awful weapons such as the M40 and MS556 to become somewhat easier to get past.\n   Common spawns are in the warehouse, at the end of the streets, and near the stairs that lead to the top of the train station. The warehouse spawn is one you'll want to target often as there is little chance for interruption thanks to it being a closed space. You'll likely snag several kills if you place your shots right as most would be expecting the enemy to come from outside the warehouse, so get flanking!\n   Rocket/recoil jumping poses a large advantage, going quickly from one side of the map to another. This becomes much more useful when you reach the roof of the garage, as it not only covers the roof of the warehouse, but pretty much every other part of the map aside from inside the warehouse. You can also access the train station roof, a more niche spot due to it making you a bigger target than Hackula, but somewhat useful as well. It's got a nice view, after all.\n   Spawncamps are really prevalent and easy to perform in this map, especially on the street spawns. These spawns have ZERO protection, so whoever spawns there will fall victim to anybody aiming in the general direction of them. If you happen to see someone pop into existence in that general area, raise hell.\n   Knifing in general on this map is pretty painful, thanks to how open it is. The only remotely viable spots to even attempt it is in the warehouse, garage, and the stairs up to the train station. Even then, it's really easy to get any of your tries to demote your foes shot down. This makes the Golden Knife difficult to kill with, as you have to hope and pray that an opponent will be lined up in what would essentially be a perfect spot. Try to go for the good knife spots, or just camp around and challenge a knife fight in the warehouse if you're feeling chicken."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap6.JPG",
         "name":"BOULEVARD",
         "info":"Map Information:\n   Boulevard is a map released in the 2.5 update. It's a very large and spacey map that favors long-ranged weapons such as snipers, or perfectly accurate weapons. However, it does provide some areas where you can confront enemies in closer ranged combat, so inaccurate weapons aren't completely useless.\n   Boulevard takes place in a residential suburban city with multiple shops.\n   The map features many places to go into. These things include a track where a trolley comes to run over anyone in its path, resulting in a demotion (you can hear it coming by its ringing sound); a gas station called Scoobies; a coffee shop called Stinky's; a juice store called Stink Juice; and multiple vehicles scattered around the area.\n   The small buildings have nice rooms that overlook the main road and gas station. As long as the area is secured with a small team, domination is essentially guaranteed. However, retaliating players may simply counter-snipe or use explosives to dislodge you.\n Tips and Tricks:\n   Boulevard is a very open map with action in specific areas. How do you win?\n   If you have shotguns or high spread automatics, these are your best friends at the gas station, parking lot, and inside the buildings.\n   If you happen to have a weapon with the Rocket/Shotgun Jumping ability, use this to your advantage to hide on top of buildings to mow your enemies down below.\n   The spawn locations on this map can give you and your team a great opportunity to corner the enemy.\n   The trolley can be easily avoided because of its distinctive sound, however, this does not mean to always stay at its path.\n   Scoped weapons such as the Barrett or the G11 can be easily used for picking off enemies at longer ranges.\n   The Golden Knife is arguably the best or worst in situations. For flanking, either go behind the office buildings or behind Stinky is Coffee shop.\n   The skin Froggy is obtainable here by killing 5 people near a frog. The frog will get bigger and bigger until it will start hopping to get the skin. You have to follow it and it will lead you to a door with wood on it. You have to break that wood and when you're finished breaking it, it will teleport you to a different server with a different map, the Apartment. You will see a stand with moving animals on it. You have to shoot all the animals except the frog until confetti comes out of the stand, and that means you got the Froggy skin\n   You can get the unusual Froggy skin by doing the Froggy quest normally, but you have to time the Frog and the train to make them collide."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap7.JPG",
         "name":"STREET CORNER",
         "info":"Map Information:\n   Street Corner takes place at a residential street. It is a very close-quarters orientated map. Most fights are close-quarters engagements. As can be gleaned from the picture, Street Corner has a road in the middle.\n   The environmental hazard within Street Corner is the occasional traffic speeding through the street. Players who get hit by one of these cars can be killed.\n   Street Corner also has a sewer, which is an L-shaped corridor with two levels, accessible by ladder. The sewer is a very popular part of Street Corner, due to the spawns within and easy to access routes to its location.\n Tips and Tricks:\n   If you want to find an alternate route, the most obvious are above the sewers, where you can flank.\n   Spawns tend to be very random and will mix up so be wary and check all possible spawns, at the end of the sewers, entrances to the sewers, and more."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap8.JPG",
         "name":"HILLSIDE",
         "info":"Map Information:\n   Hillside was released in the 2.6 Update. Hillside takes place in a lakeside park, with a cluster of buildings on top of the hill. There are tunnels on both sides of the map to connect the pathways. The terrain is rough outside the buildings leaving one team to fight up the hill.\n   There is almost no cover in this map, so players cannot hide behind a wall to avoid being hit. This will most likely result in very quick deaths, so players must try to get as many kills as possible before dying. This map relies on brute-forcing attacks, where the most successful player is the one that can get the most kills within a short time span.\n Tips and Tricks:\n   Hillside is a fairly large map. Try to flank as much as possible so you could eliminate players by surprise.\n   Long-range weapons strive on the hill part while close-range weapons strive in the corridors\n   Like the first tip, it is a fairly large map, and flanking could take a while. The PIZZA can be useful in this situation, giving you the speed boost and allows you to catch up to opponents, probably the easiest way to get a knife kill."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap9.JPG",
         "name":"AIRCRAFT",
         "info":"Map Information:\n   Aircraft is a map released in the Summer Update. The map takes place on an aircraft carrier filled with shipping containers parked next to an island with a volcano. Players can enter the air-traffic control tower and bridge, which features catwalks, a meeting room, and destroyable windows. Out of the playable area, there are fighter jets lined up as if they were ready to take off.\n Tips and Tricks:\n   Use crates to gain height advantage and allow yourself for more flexibility in movement unlike the long walkway on the second or third level of the ship.\n   Fights will often be in cramped spaces, try to pre-fire around corners to land the first shots if you run into someone.\n   The first level of the ship has hallways that leads to other parts of the map."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap10.JPG",
         "name":"BEACH",
         "info":"General Information:\n Beach is a map in Arsenal that was released in the Summer Update, it takes place at a coastal suburban beach with a metro station.\n   In-game, Beach includes a variety of all-range encounters, from the long sightline of the shack to the close to long-range metro tunnels.\n Tips and Tricks:\n   Camp the top parts to dominate the enemies on the ground and in the water (if visible), and alternatively camp in the water near the small pier to dominate the enemies on top (if visible) and on the ground.\n   Hide under the wooden bridge and you will become partially submerged, allowing yourself to be less exposed while being given a wide-angle to fire from.\n   If you are lucky and spawn by the sandcastle while having the golden knife, you can jump onto the yellow room and out through the window if the other team is by the subway. You can then climb the stairs and jump down from the opening beside the red building and backstab someone."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap11.JPG",
         "name":"KITCHEN KHAOS",
         "info":"Map Information:\n Kitchen Khaos was released in the Summer Update. It takes place in a giant kitchen that is filled with random props.\n   This map is a big messy kitchen. It is a good map for trick-shooting when using the trampolines or falling from high places and/or stomping them. There is also a lot of cover in this map.\n   There was a placeholder map exclusive to private servers called Kitchen 2020, it is a revamp of Kitchen Khaos.\n Tips and Tricks:\n   Most of the fighting will occur under the table and near the spawns.\n   All of the spawnpoints except for the mousetrap spawnpoint are ideal places for camping. However, be aware that more proactive players will use the trampoline in the brick fort to try to pick you off.\n   The trampolines are extremely useful, as they allow you to get to the main spawns quickly, and also allow you to perform creative flanks.\n   Kitchen Khaos supports almost every playstyle. If you like camping, sit around at spawn.\n   While all of the spawns are viable camping spots, the cabinet spawn near the sinks is arguably the best one, as you get the best view of the place.\n   The Knife is incredibly useful in this map when taking the trampolines into consideration.\n   Weapons that can boost jump are particularly useful in this map, allowing ease of movement without the use of trampolines. This can catch opponents off guard easily since most would expect people to fly near the trampolines.\n   Normally, in 2 teams, you would spawn either side of the map. If you get the spawn near the grill and see some campers on the opposite side, go inside the little hole in the wall, follow the path, and backstab the campers."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap12.JPG",
         "name":"VILLA",
         "info":"General Information:\n   Villa is a map in Arsenal that was added in the September Update and can be played in all gamemodes with the exception of Brickbattle. It can also be played in all teams.\n   Villa takes place on a large mansion that is in the middle of the map. The mansion is noticeably empty, the only things inside are two staircases. There is also a really spacious area outside that has, a small patch of grass with a palm tree outside and next to it, a gate leading to a non-accessible staircase outside the playable area, a cliff walk on the side of the building, another set of stairs outside that is accessible, a arch way leading to a ramp that has a couple of boxes next to it, and a walk way. The mansion takes place on somewhat of a cliff edge.\n   Falling off of the map will result in you dying and losing a level, just like any other map hazard.\n Tips and Tricks:\n   Villa is an extremely small map with a few spawns. Like Sandtown, this map is extremely small and will pretty much always have a skirmish happening somewhere. Unlike Sandtown, however, Villa has more chokepoints and fewer places to simply point and shoot down. Be careful!\n   Spawns are likely to swap frequently. Like any other small map, pay attention to where your team is going and react accordingly.\n   The stairs are a particularly useful vantage point, but you shouldn't stay there for long.\n   Any area of the house can be considered a kill-zone, considering how closed the place is. Be ready for either sudden kills or sudden deaths, you never know what could happen.\n   Since there are so many closed areas, Villa is an ideal map for practicing/performing trickstabs. If you can react and/or predict an enemy's moves, you can skillfully maneuver and demote them accordingly.\n   The roof is a very strong vantage point and is usually accessed through boost jumping. If you manage to get up there, camp and use it while you can.\n   While boost jumping is the easiest way to access the roof, there is a lesser-known path involving the balcony near the big staircase. Simply jump on the railing, then crouch jump onto the roof.\n   The Golden Knife is easier to use on this map compared to others. With its high speed and double-jump capability can allow you to access the roof through unconventional means, allowing you to easily flank other enemies. Trickstabbing is viable too, as the abundance of closed spaces works to your advantage.\n   It is highly recommended to take alternate routes on this map since most of the battles happen inside the house, and you can get easily spawn-camped.\n   Shotguns are very viable on this map since the map is very closed and there is plenty of corridors and small rooms."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap13.JPG",
         "name":"GLACIER",
         "info":"General Information:\n   Glacier, originally called Glacier Outpost[1] is a map that was released on 12/23/19 and was originally in private servers. The map takes place in a small base camp in the North Pole on a huge glacier. There are multiple small cabins on top of a frozen glacier with multiple survival notes.\n Crystal Mine Operation Story:\n   In this map, there are notes inside two cabins which are actually a long story if you combine them.\n   Mechanic and Brute with a crew of 17 Arctic Excavators planned on mining crystals, which Mechanic described them to be great power source. Mechanic was operating the radio and Brute is the medic as Mechanic told him to set up medkits in the medic cabin, which Brute thought was unnecessary.\n   Day 15 of the operation, 3 crew members disappeared because of a giant wave crashed against the glacier.\n   Day 52, it is revealed that they are apparently going to use crystals to make RoboDelinquent.\n   Day 98 of the operation, all crew members disappeared in the night except Brute. The radio seems to be broken and Mech tries to make it work again so he can call people to take them back home.\n   Day 104 of the operation, Brute has gone missing as he went to check on cavern on Friday.\n   Day 129, Mechanic is getting cold and equipment starts acting strange because of weather.\n   Day 138, Mechanic is now alone on the iceberg and trying to search for Brute, but he couldn't find him.\n   The final moment of Mechanic on the next day, he was hiding under the desk while something was in his cabin writing a note but couldn't finish it due to someone catching him."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap14.JPG",
         "name":"MIDTOWN",
         "info":"General Information:\n   Midtown is a map that takes place in the downtown of an urban community. The map is a community-made map that was originally only available in private servers. The map is rather open but makes use of elevation and buildings to break sightlines and add areas for play. There are also multiple okapis to hide and several ramps leading to rooftops.\n   The map features a substantial amount of buildings surrounding an area fulfilled with vehicles. There is also multiple advertisement signs with a silver border. A building is placed at the right side of the map along with a pit that is accessible to players.\n   This map is used to activate the Slaughter event.\n Map History:\n   03/16/20: Added into the game of Arsenal in private servers.\n   03/18/20: Added into the public rotation.\n   01/16/21: Added a ROLVe logo sign at one of the buildings.\n   02/03/21: Added a desktop, a breakable traffic besides the ROLVe sign building.\n Trivia:\n   There are many advertisements scattered around the map including Awesome Soda, One Phone, BOX, The Tunnel, Bloxy Cola and the iconic Banana.\n   There is a pillar of credits to the map developers.\n   The map has a reskinned yellow semi-truck found in many previous Arsenal maps.\n   There is a decal of Chaseroony. The decal object's name is NOT an idiot.\n   There is also a decal of KonekoKitten and a dog named Corgi.\n   Near the double scaffolding, there is a wanted poster. The bounty? Some dude, for 999R$."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap15.JPG",
         "name":"TUSCAN",
         "info":"General Information:\n   Inspired by Italian architecture, Tuscan is a moderately sized urban map and is somewhat asymmetrical and symmetrical that follows a three-lane rule, much like a Counter-Strike map. Both sides of the map are almost symmetrical with minor differences. Both alleys have the same layout with minor color changes. The middle section of the map is filled with a brick road and connected to via four alleys and two interiors. One interior is an eatery named da Vinci Diner, the other is an unnamed clothing shop.\n Tips and Tricks:\n   Ah yes, a beautiful afternoon in Italy. What's that? Bullets flying over your head? Quick! Survive!\n   The center of the map is where the most action is. Be prepared.\n   If you have the Golden Knife at spawn, jump on the fence, then jump on a tree. You then can access the roof and watch above for your victim.\n   Shotguns can be quite useful if you are raiding a spawn.\n   Rocket/Recoil Jumping is useful and is easy to go from one side to the other side of the map.\n   Using alternate routes can help flank opponents.\n Map History:\n   03/20/20: Added into the Showtime! Update of Arsenal.\n   03/21/20: Fixed glasses for out of bounds buildings.\n   05/16/20: Added a obby as part of the Coffee quest.\n   06/21/20: Optimized skybox textures.\n   08/28/20: Added decorations and balloons then later removed.\n   10/26/20: Changed map theme to Halloween and removed the Coffee Quest.\n   11/20/20: Reverted back to normal and re-added back the Coffee Quest.\n   01/09/21: Fixed a bug where buildings were all fully red."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap16.JPG",
         "name":"MATRIX",
         "info":"General Information:\n   Matrix is a map that was released in the Sci-Fi Update. The map mostly consists of grids, blocks, wedges, and crates studs.\n Tips and Tricks:\n   Using the second floor of the building can help when you have the Golden Knife.\n   The 4 corners of the map are covered, you can easily spawn-kill in here.\n   The 4 corners can be used to flank enemies.\n Trivia:\n   The map begun its development on September 6th, 2020.[1]\n   The update logs mentioned that the map was locked to 2 teams. But actually, it was not the case.\n   The map showed most of the parts' studs:\n   Some of the blocks are 3x3 and 6x6.\n   The crates are 3x3.\n   The Rolce railings are 12.\n Map History:\n   09/29/20: Added into the Sci-Fi Update of Arsenal.\n   11/20/20: Added one more crate to the map.\n   01/04/21: Added an extra spawn to Free For All.\n   02/03/21: Removed the two-way spawn."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap17.JPG",
         "name":"ROLVE STATION",
         "info":"Map Information:\n   ROLVe Station is a map in Arsenal that takes place inside of a Sci-Fi spacecraft. It has teleporters around the map, marked as 1, 2, 3 and 4. It is an open map with two floors.\n Tips and Tricks:\n   Use teleporters to quickly navigate around the map.\n   Attack enemies from above.\n   Flank someone with the Golden Knife by using the teleporters to surprise attack someone near the teleporter.\n Trivia:\n   The map was originally called Facility.\n   This is the first map to feature teleporters.\n   Outside the map, there are some asteroids around the station.\n   If a player's graphics setting is at least four or above, PrimE can also be seen outside of the map.\n   There is a glitch/bug where if the game lags frequently, the teleporters will not teleport a player upon stepping.\n Map History:\n   09/29/20: Added into the Sci-Fi Update of Arsenal.\n   02/05/21: Changed menu background."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap18.JPG",
         "name":"CANALS",
         "info":"General Information:\n   Canals is a map released on October 31, 2020 as part of the Halloween Update II.\n   The map features destroyed vehicles scattered around and an small town connected via an bridge, and the spawnpoints located in opposite sides of the map. The water will demote players if they go out of bounds.\n Tips and Tricks:\n   Players can snipe unsuspecting players by Rocket/Recoil Jumping into buildings and sniping the players who are walking in the bridge.\n Trivia:\n   The map was featured in the DevForum post when it was going to be added an week later.\n   The map was listed as Spooky Canals in the update logs.\n   A poster about the Cawfee Emote was founded here.\n Map History:\n   10/31/20: Added in the Halloween Update II: Part II of Arsenal.\n   01/01/21: Removed from the public rotation.\n   03/16/21: Re-added back to the public rotation.\n   The map now takes place on daylight.\n   Removed most of the Halloween variants.\n   Fixed collision issues with vehicles and foreground props and minor void gaps.\n   New map named CanalsHalloween that features the map with all the Halloween variants.\n   04/04/21: Added a new icon."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap19.JPG",
         "name":"DUSTSTORM",
         "info":"General Information:\n   Duststorm is an Arsenal map which was first added in private servers on Christmas Update II: Part I for testing, it was later put on rotation during part II.\n Tips and Tricks:\n   In the spiral staircase, there is a ladder leading to the roof which provides a great vantage point for shooting.\n   A downside to this however is that you can easily get flanked while on the roof since you can't look down because the cover blocks your view.\n Trivia:\n   The map begun its development on August 21, 2020.\n   The map can be played here.\n   Much like Christmas Dinner, Winter Park and The Mines, MyFootLettuce was left uncredited on the Twitter post announcement due to Krystal Flynn being given a list of map creators by EMIRPEIRF excluding Foote.\n Map History:\n   12/13/20: Added into the Christmas Update II: Part I of Arsenal as a private servers-only map.\n   Fixed bug.\n   12/14/20: The map now display the map creators.\n   12/17/20: A minor update:\n   Enlarged the map.\n   Moved spawn points and added covers to prevent spawn camping.\n   The cliff was stylishly updated.\n   Added a secret green cube.\n   12/23/20: Removed the get the Monky skin hidden room and moved the button at the left side of the Monky room.\n   12/24/20: Added into the public rotation.\n   The Monky room is now removed.\n   01/04/21: Improved ladder collisions."
      }
   ],
   "brickbattlemaps":[
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/brickbattlemaps1.JPG",
         "name":"BLOXBURG",
         "info":"Map Information: \n    Bloxburg was a map that is in the Brickbattle gamemode. It was featured in the original ROBLOX Battle and was created by Games. This map takes place in a city and a plaza. Much like many other Brickbattle maps, some of the parts can be blown up by explosives.\nThis map was removed from Arsenal along with Brickbattle gamemode in Halloween Update.\n Map History: \n    01/11/19: Added into Arsenal.\n02/09/19: Accidentally removed from Arsenal.\n02/16/19: Re-added back to the game of Arsenal.\n10/24/19: Removed from the public rotation."
      },
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/brickbattlemaps2.JPG",
         "name":"CROSSROADS",
         "info":"Map Information:\n    Crossroads is a map in the BrickBattle gamemode. Many parts of the map can be blown up by explosives. It is based on a former popular ROBLOX game of the same name developed by early ROBLOX staffs. Initially, all of the spawn points and a few structures from the map were removed for Arsenal.\nThis map was removed from Arsenal along with Brickbattle game mode in Halloween Update.\n    Map History: \n 01/11/19: Added into Arsenal.\n02/09/19: Accidentally removed from Arsenal.\n02/16/19: Re-added back to the game of Arsenal.\n10/24/19: Removed from the public rotation."
      },
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/brickbattlemaps3.JPG",
         "name":"CHAOS CANYON",
         "info":"Map Information:\n Chaos Canyon is a map featured in the Brickbattle gamemode. It was created by Shedletsky and community members in 2007. It was used for a Brickbattle type game on the ROBLOX profile. The map takes place on a canyon called Desolation Valley, there's thin walls, a bunker, a exterior-column and two specific towers. Much like many other Brickbattle maps, some of the parts can be blown up by explosives.\nThis map was removed from Arsenal along with Brickbattle gamemode in Halloween Update.\n Map History:\n   01/11/19: Added into Arsenal.\n02/09/19: Accidentally removed from Arsenal.\n02/16/19: Re-added back to the game of Arsenal.\n10/24/19: Removed from the public rotation."
      }
   ],
   "reskinnedmaps":[
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/reskinnedmaps1.JPG",
         "name":"HEIGHT FRIGHTS",
         "info":"General Information:\n   Height Frights takes place in an open-ended map set in a theme park surrounded by a castle at dawn. Areas mix of long to close-ranged combat with most encounters near the drop tower & gamer grill stalls.\nHeight Frights features one roller coaster, two flat rides, and a couple more shop & game stalls.\n Tips and Tricks:\n   There are many high vantage points. These include:\nThe Ferris wheel, the most used, the easiest, and most useful vantage point to use, as hiding in the car not only shields you from damage, but it also gives you a nice view, allowing you to fire upon any unsuspecting players.\nAny and all of the roofs present on the map.\nThe top of the dropping machine ride, the highest point on the map.\nThe trees, not commonly used but still useful nonetheless.\nThis map is very open, making snipers and straight-shooting weapons ideal. Weapons that can boost jump are also especially useful considering the many height vantages.\nThe top of the dropping machine is the highest point in the map, making it useful for sniping, but not ideal for other weapons. It's hard enough to get there anyway, so stick to other spots. Unless you want to meme or pick off enemies from longer ranges, then go for it.\nThe roller coaster is a strange feature of the map. You'll likely not hit any of the enemies while on it, but they likely won't hit you either. Getting hit by the roller coaster will count as an environmental death and will likely demote you. Note that if you exit the roller coaster while the roller coaster is still moving you will be demoted.\nYou'll have a particularly hard time securing a kill with the Golden Knife in most situations on this map. Try to take alternative routes or drop from a high place to give yourself the best bet at winning.\nFlanking is practically impossible, so you would have to rely on direct combat. Weapons that have a good movement speed to get to the front line faster with straight-forward shooting like the MP9-S will strive well."
      },
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/reskinnedmaps2.JPG",
         "name":"SAFEHOUSE",
         "info":"Map Information:\n Safehouse takes place in a hilly woodland area with a craftsman styled house as the focal point. The map is inspired by the CS:GO map, de_safehouse, but has a different layout outside of the house.\nMultiple rocks, rocky terrain, and trees make it a extremely dynamic map, providing natural cover or vantage points. A cobblestone wall blocks the two sides of the map, however there are some ways around it, with there being a shed that you can climb over to get to the other side, and a 2 planks on the other.\n Tips and Tricks:\n   Safehouse is the most straight forward map of all of the maps. With an open spawn area and a closed house area, a skirmish is likely always happening on this map.\nMost players will try to get as many kills as possible going through the main hallway and the kitchen. If you want to get the drop on them, go through one of the windows and flank.\nThe roof is a very strong vantage point, especially if the enemy is spawning in the lower spawns. If you get there, exploit it to its fullest potential.\nIf you want to avoid the house in its entirety, go to the walls and use the planks to flank the enemy.\nThe lower spawn is possibly the worst area to be in on this map. It is, quite literally, an uphill battle from there. Work with your team to push and regain the upper spawn, then turn the tables!\nThe stairs are a nice section to camp on if the enemy is spawning from the upper spawns. Since most of them will be looking down the hallway, pick off any unfortunate souls, then book it once you start getting shot at.\nThe roof, the trees, and the large window on upper-spawn side of the house can be used to get the drop on anybody walking into the hallway. This is especially useful when you're on the Golden Knife.\nWhich is that you're likely to have a hard time getting a kill on this map unless the person you're chasing is inside the house. Use any of the flank routes mentioned above, and win!"
      }
   ],
   "removedmaps":[
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/removedmaps1.JPG",
         "name":"EASTERN",
         "info":"Map Information: \n Eastern is a legacy map from Pre-Filtering Enabled Arsenal. It was removed from Arsenal in early 2016, but was added back as a private server-exclusive map later on for the revamp of Arsenal.\nBoth teams spawn on opposites of the map and clash in this long corridor type map. The entire map seems to take place in an apocalyptic highway or road. The middle area has some ladders, scaffolding, platforms, fences and road barriers while the red and blue areas have mini blocky buildings and burning, destroyed cars. Also throughout the map, there are arches with cones on the top of them."
      },
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/removedmaps2.JPG",
         "name":"BANK",
         "info":"Map Information:\n Bank is a legacy map from Pre-Filtering Enabled Arsenal.\nThis map is a replica of the de_bank map from Counter-Strike: Global Offensive. It was removed from the Arsenal map rotation in mid-2016.\nThe map features the main bank, which is having restorations, because of this, there is a ladder to the top of the building. Inside the bank, there is a lobby that features little decor. Next to the bank, there is a industrial building with a truck that has skidded off course. There are other buildings on the opposite side."
      }
   ],
   "murdermaps":[
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/murdermaps1.JPG",
         "name":"OFFICE",
         "info":"General Information: \n   Office is the first map to be added in MURDER. This map takes place around an office complex with parking areas outside of the building during the winter season. There are containers, a ladder and stairways around the map that can lift and leads the player inside the office.\nThere's also a parked van reflected through the window at the terrorists' spawn.\nThis map is taken from Counter Blox."
      },
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/murdermaps1.JPG",
         "name":"AGENCY",
         "info":"General Information: \n Agency is a map originally from Counter-Strike: Global Offensive as a hostage map. It takes place in a commercial penthouse ontop of a skyscraper. The interior is a two-floor office. The first floor has a giant, open lobby with stairs leading up to the second floor, along with two hallways leading to a small cafeteria and a large space. Said large space is overlooked by a balcony.\nOn the second floor, the stairs from the lobby lead into an office space, which connects via an upstairs balcony-way to the main offices. The main offices contains a conference room, a janitor closet, and workspaces.\nAgency has multiple windows on the second-floor main office, though they do not have glass, unlike its origin, Counter Blox. Falling off the map causes the player to lose a level since it is an environmental kill.\nAround the map are several colored balls. The colors of these balls include red, yellow, green, blue, purple, and pink.\n Tips and Tricks:\n   Agency is a map with many rooms, and action happening at every corner. How do you survive?\nThe map is mainly suited for close-quarters, up-close and personal combat.\nExplosive-weapons such as the M16A2 are extremely devastating at close range: With hardly any room to maneuver in such tight space, a single blast could kill multiple players in one shot.\nShotguns also find their niche here, with their capability to fill a narrow, tight space with dozens of pellets in a second.\nIf you climb up the staircase in the room that leads outside, you can find some small openings to shoot through."
      }
   ]
}
