{
"banner": "3966814946749531_3966815070082852",
"ins": "3966814946749531_3966815076749518",
   "currentmaps":[
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap1.JPG",
         "name":"SANDTOWN",
         "info":"General Information:\n   Sandtown is a standard map in Arsenal. The map takes place in a Middle Eastern market district. It is the second smallest map in the game, with Bridge being the smallest.\nThere are planks connecting buildings and roofs to buildings. On ground level, it features a fountain in the heart of the map, narrow pathways leading the buildings, and a wide and open space, making it not much of a hassle to find the action. It also features a little shack containing hay, ways to get up to the buildings as mentioned earlier, and the carpeted inside of the buildings.\nShortly after the start of a round on this map, a scripted event occurs in which a plane crashes into the tallest building on the map, with its right wing falling off and bridging the balcony near the bottom of the building with a nearby staircase. The plane can then be reached by Rocket/Recoil Jumping.\nOn the other two buildings, they have a metallic plank (aka. the plane's wing) connecting them, and a staircase leading up to one of them. Also, it features a stone arch which leads to another part of the map where there is a little plank leading to the other side, a way into one of the carpeted buildings, and more. One spawn point is wide open to players ready to shoot at you.\nThere all sorts of chokepoints, including the area underneath the crashed airplane to the left rooftop of the building left of the wires.\n Tips and Tricks: \n    Sandtown, being one of the smallest maps in the game, means there will always be a firefight somewhere on the map, no exceptions. With constantly shifting spawns, bullets flying from every corner, this map promises never-ending action gameplay.\nSpawns are likely to shift at any given moment and pay attention to where your teammates are heading and figure out where the enemy is going to come from next.\nWhile heights are often a huge advantage in other maps, in Sandtown, it is relevant. The small map size means that the enemy could come from anywhere. The only option is to stay on your toes and eliminate anybody who crosses your path.\nExplosives and shotguns are useful on this map. Enemies are likely to press their faces against the camera or bunch up constantly, so take advantage of those situations!\nThe plane is a viable camping spot, but as stated before, you're likely to either fall behind or get picked off.\nYou can walk on the clotheslines by platforming on the arch near the building spawn. While it might not be too useful, since it leaves you open, it's good if your opponents are focused on where your teammates are. Flank them and secure kills.\nThe Golden Knife is extremely dangerous in this map, since the wielder can quite literally jump from anywhere with its double jump capability. It has many parkour queues. If you happen to get your hands on it, platform onto a higher spot and get the drop on an unsuspecting enemy. Preferably, a rooftop.\nThe middle of the map is usually where the fights go on play, go seek for higher heights to not be part of it.\nThe building that looks over the entire center of the map can easily be ambushed if you fail to keep track of the stairs. Check the route on the side to quickly deal with flankers."
      },
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap2.JPG",
         "name":"SAFEHOUSE",
         "info":"Map Information: \n   Safehouse takes place in a hilly woodland area with a craftsman styled house as the focal point. The map is inspired by the CS:GO map, de_safehouse, but has a different layout outside of the house.\nMultiple rocks, rocky terrain, and trees make it a extremely dynamic map, providing natural cover or vantage points. A cobblestone wall blocks the two sides of the map, however there are some ways around it, with there being a shed that you can climb over to get to the other side, and a 2 planks on the other. \n Tips and Tricks: \n Safehouse is the most straight forward map of all of the maps. With an open spawn area and a closed house area, a skirmish is likely always happening on this map.\nMost players will try to get as many kills as possible going through the main hallway and the kitchen. If you want to get the drop on them, go through one of the windows and flank.\nThe roof is a very strong vantage point, especially if the enemy is spawning in the lower spawns. If you get there, exploit it to its fullest potential.\nIf you want to avoid the house in its entirety, go to the walls and use the planks to flank the enemy.\nThe lower spawn is possibly the worst area to be in on this map. It is, quite literally, an uphill battle from there. Work with your team to push and regain the upper spawn, then turn the tables!\nThe stairs are a nice section to camp on if the enemy is spawning from the upper spawns. Since most of them will be looking down the hallway, pick off any unfortunate souls, then book it once you start getting shot at.\nThe roof, the trees, and the large window on upper-spawn side of the house can be used to get the drop on anybody walking into the hallway. This is especially useful when you're on the Golden Knife.\nWhich is that you're likely to have a hard time getting a kill on this map unless the person you're chasing is inside the house. Use any of the flank routes mentioned above, and win!"
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap3.JPG",
         "name":"AGENCY",
         "info":"General Information:\n   Agency is a map originally from Counter-Strike: Global Offensive as a hostage map. It takes place in a commercial penthouse ontop of a skyscraper. The interior is a two-floor office. The first floor has a giant, open lobby with stairs leading up to the second floor, along with two hallways leading to a small cafeteria and a large space. Said large space is overlooked by a balcony.\n   On the second floor, the stairs from the lobby lead into an office space, which connects via an upstairs balcony-way to the main offices. The main offices contains a conference room, a janitor closet, and workspaces.\n   Agency has multiple windows on the second-floor main office, though they do not have glass, unlike its origin, Counter Blox. Falling off the map causes the player to lose a level since it is an environmental kill.\n   Around the map are several colored balls. The colors of these balls include red, yellow, green, blue, purple, and pink.\n Tips and Tricks:\n   Agency is a map with many rooms, and action happening at every corner. How do you survive?\n   The map is mainly suited for close-quarters, up-close and personal combat.\n   Explosive-weapons such as the M16A2 are extremely devastating at close range: With hardly any room to maneuver in such tight space, a single blast could kill multiple players in one shot.\n   Shotguns also find their niche here, with their capability to fill a narrow, tight space with dozens of pellets in a second.\n   If you climb up the staircase in the room that leads outside, you can find some small openings to shoot through."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap4.JPG",
         "name":"DIZZY",
         "info":"General Information:\n   Dizzy is a map in Arsenal, and can be played in all gamemodes with the exception of Brickbattle and Laser Mania. It's also locked to 2 teams, and cannot be played in 4 teams or FFA, even if they're voted for.\n   Dizzy takes place to be set on top of a tall building undergoing construction at the top, with two identical (save for color) main buildings separated by a lower tunnel, ladders, and a large bundle of wood able to be traversed upon.\n   Falling off of the building will result in dying and losing a level, just like any other map hazard. It is one of the smallest maps in the game, only overshadowed by Sandtown and Bridge.\n   It is possible to reach the top of the crane either using the DBS's, Barrett's or DB Shotgun's recoil jump ability, or a rocket jump. However, rocket jumping on the crane can be harder.\n Tips and Tricks:\n   Dizzy is an easy map to memorize, being near-perfectly symmetrical and straightforward. Most skirmishes will occur in the center area between the two buildings above the basement. Since the spawns aren't that far apart, they swap frequently. Please watch your back.\n   This map has few checkpoints, so there are few options when it comes to flanking. The basement is often forgotten, however, so use it to sneak behind the enemy lines and secure several kills when possible.\n   The small house is a particularly strange spot, as it can be your best friend or your greatest enemy. The secluded area leaves your enemies quite literally small windows to damage you. However, you are very, very susceptible to explosions within it. If someone happens to enter, try to demote them using your knife, as there's little room to run for them.\n   The crane is another strange spot. While it might be ideal for camping, it's absurd height makes it not so ideal. However, this spot is a killer in Clown Infection, make your way up there and escape the horde!\n   The roofs of both of the buildings are good vantage points, especially when there are fewer players around. However, you are at risk for an attack from behind, since the roofs are rather close to one of the main spawns, be careful!\n   The ladders are an often overlooked place to secure kills. People tend to forget they are being shot at when climbing one, so take advantage.\n   Since the map is so small, the Golden Knife has its own advantages and disadvantages depending on placement. Out of spawn, it's extremely likely you'll be killed before you can even get close, considering the map size. However, if you manage to move well, you can easily snag a kill, as the enemies will most likely be distracted by the center skirmish.\n   If you happen to knock someone off the map with an explosive weapon, focus on someone else as the other person falls.\n   If you spawn on the bridge section, be mindful of where you're going. A common mistake with players who want to get to the front lines quickly is accidentally walking off the bridge and losing a level.\n   There is also another secret where you can shotgun jump onto the top of the crane and see multiple lines of texts inside.\n   If you fall off the map, but have an explosive weapon that can rocket jump, or a DBS and DB Shotgun, hug the wall and shoot below your feet. Hugging the wall will cause you to fall slower, and allows you to rocket jump as well.\n   It's fairly easy to predict spawns. If most of your team are on one side of the map, the enemy will likely spawn on the other side."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap5.JPG",
         "name":"ASSAULT",
         "info":"Map Information:\n   Assault is a recreated version of the popular CS:GO and CS Source map known as: cs_assault. It takes place around an industrial warehouse, with access to the area being blocked off. It's separated into 5 distinct parts, the train station, the warehouse on the left side of the map, the two parallel streets next to them, and the long street that connects the warehouse and the parallel streets.\n   The Warehouse has an upper section and a lower section. The upper section has a door in the back that leads to one of the parallel streets, and there is also a door in the lower section that leads to the same street. There is a larger warehouse door that leads to the long street.\n   The Train Station is positioned above the rest of the landmarks, making it a good place to camp.\n   The two parallel streets just lead onto the main connecting road. People will spawn at the end of these roads, so it's nice to dip around and shoot some of them. The two parallel roads are connected by a small alleyway that houses a few trash bags and broken cars.\n   The main street connects all of the previous landmarks. You can enter the warehouse, go onto either of the two parallel streets and walk up to the train station. There aren't any decent barricades on this street, and makes you slightly easier to hit.\n Tips and Tricks:\n   A map straighter than a railgun shot, choked by a small garage, accented by a stocked warehouse, and tied into a knot of endless firefight with the trademark train station, Assault is a map that has two simple states of combat: constant straight shooting chaos, or hilariously one-sided vantage pushes. Considering that most matches in Arsenal aren't that coordinated, you can count on the first happening most of the time.\n   Many weapons that have tight spread and good accuracy are extremely powerful in this map due to the amount of open space and straight sightlines. Snipers are also considerably more useful than normal thanks to this, allowing potentially awful weapons such as the M40 and MS556 to become somewhat easier to get past.\n   Common spawns are in the warehouse, at the end of the streets, and near the stairs that lead to the top of the train station. The warehouse spawn is one you'll want to target often as there is little chance for interruption thanks to it being a closed space. You'll likely snag several kills if you place your shots right as most would be expecting the enemy to come from outside the warehouse, so get flanking!\n   Rocket/recoil jumping poses a large advantage, going quickly from one side of the map to another. This becomes much more useful when you reach the roof of the garage, as it not only covers the roof of the warehouse, but pretty much every other part of the map aside from inside the warehouse. You can also access the train station roof, a more niche spot due to it making you a bigger target than Hackula, but somewhat useful as well. It's got a nice view, after all.\n   Spawncamps are really prevalent and easy to perform in this map, especially on the street spawns. These spawns have ZERO protection, so whoever spawns there will fall victim to anybody aiming in the general direction of them. If you happen to see someone pop into existence in that general area, raise hell.\n   Knifing in general on this map is pretty painful, thanks to how open it is. The only remotely viable spots to even attempt it is in the warehouse, garage, and the stairs up to the train station. Even then, it's really easy to get any of your tries to demote your foes shot down. This makes the Golden Knife difficult to kill with, as you have to hope and pray that an opponent will be lined up in what would essentially be a perfect spot. Try to go for the good knife spots, or just camp around and challenge a knife fight in the warehouse if you're feeling chicken."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap6.JPG",
         "name":"BOULEVARD",
         "info":"Map Information:\n   Boulevard is a map released in the 2.5 update. It's a very large and spacey map that favors long-ranged weapons such as snipers, or perfectly accurate weapons. However, it does provide some areas where you can confront enemies in closer ranged combat, so inaccurate weapons aren't completely useless.\n   Boulevard takes place in a residential suburban city with multiple shops.\n   The map features many places to go into. These things include a track where a trolley comes to run over anyone in its path, resulting in a demotion (you can hear it coming by its ringing sound); a gas station called Scoobies; a coffee shop called Stinky's; a juice store called Stink Juice; and multiple vehicles scattered around the area.\n   The small buildings have nice rooms that overlook the main road and gas station. As long as the area is secured with a small team, domination is essentially guaranteed. However, retaliating players may simply counter-snipe or use explosives to dislodge you.\n Tips and Tricks:\n   Boulevard is a very open map with action in specific areas. How do you win?\n   If you have shotguns or high spread automatics, these are your best friends at the gas station, parking lot, and inside the buildings.\n   If you happen to have a weapon with the Rocket/Shotgun Jumping ability, use this to your advantage to hide on top of buildings to mow your enemies down below.\n   The spawn locations on this map can give you and your team a great opportunity to corner the enemy.\n   The trolley can be easily avoided because of its distinctive sound, however, this does not mean to always stay at its path.\n   Scoped weapons such as the Barrett or the G11 can be easily used for picking off enemies at longer ranges.\n   The Golden Knife is arguably the best or worst in situations. For flanking, either go behind the office buildings or behind Stinky is Coffee shop.\n   The skin Froggy is obtainable here by killing 5 people near a frog. The frog will get bigger and bigger until it will start hopping to get the skin. You have to follow it and it will lead you to a door with wood on it. You have to break that wood and when you're finished breaking it, it will teleport you to a different server with a different map, the Apartment. You will see a stand with moving animals on it. You have to shoot all the animals except the frog until confetti comes out of the stand, and that means you got the Froggy skin\n   You can get the unusual Froggy skin by doing the Froggy quest normally, but you have to time the Frog and the train to make them collide."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap7.JPG",
         "name":"STREET CORNER",
         "info":"Map Information:\n   Street Corner takes place at a residential street. It is a very close-quarters orientated map. Most fights are close-quarters engagements. As can be gleaned from the picture, Street Corner has a road in the middle.\n   The environmental hazard within Street Corner is the occasional traffic speeding through the street. Players who get hit by one of these cars can be killed.\n   Street Corner also has a sewer, which is an L-shaped corridor with two levels, accessible by ladder. The sewer is a very popular part of Street Corner, due to the spawns within and easy to access routes to its location.\n Tips and Tricks:\n   If you want to find an alternate route, the most obvious are above the sewers, where you can flank.\n   Spawns tend to be very random and will mix up so be wary and check all possible spawns, at the end of the sewers, entrances to the sewers, and more."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap8.JPG",
         "name":"HILLSIDE",
         "info":"Map Information:\n   Hillside was released in the 2.6 Update. Hillside takes place in a lakeside park, with a cluster of buildings on top of the hill. There are tunnels on both sides of the map to connect the pathways. The terrain is rough outside the buildings leaving one team to fight up the hill.\n   There is almost no cover in this map, so players cannot hide behind a wall to avoid being hit. This will most likely result in very quick deaths, so players must try to get as many kills as possible before dying. This map relies on brute-forcing attacks, where the most successful player is the one that can get the most kills within a short time span.\n Tips and Tricks:\n   Hillside is a fairly large map. Try to flank as much as possible so you could eliminate players by surprise.\n   Long-range weapons strive on the hill part while close-range weapons strive in the corridors\n   Like the first tip, it is a fairly large map, and flanking could take a while. The PIZZA can be useful in this situation, giving you the speed boost and allows you to catch up to opponents, probably the easiest way to get a knife kill."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap9.JPG",
         "name":"AIRCRAFT",
         "info":"Map Information:\n   Aircraft is a map released in the Summer Update. The map takes place on an aircraft carrier filled with shipping containers parked next to an island with a volcano. Players can enter the air-traffic control tower and bridge, which features catwalks, a meeting room, and destroyable windows. Out of the playable area, there are fighter jets lined up as if they were ready to take off.\n Tips and Tricks:\n   Use crates to gain height advantage and allow yourself for more flexibility in movement unlike the long walkway on the second or third level of the ship.\n   Fights will often be in cramped spaces, try to pre-fire around corners to land the first shots if you run into someone.\n   The first level of the ship has hallways that leads to other parts of the map."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap10.JPG",
         "name":"BEACH",
         "info":"General Information:\n Beach is a map in Arsenal that was released in the Summer Update, it takes place at a coastal suburban beach with a metro station.\n   In-game, Beach includes a variety of all-range encounters, from the long sightline of the shack to the close to long-range metro tunnels.\n Tips and Tricks:\n   Camp the top parts to dominate the enemies on the ground and in the water (if visible), and alternatively camp in the water near the small pier to dominate the enemies on top (if visible) and on the ground.\n   Hide under the wooden bridge and you will become partially submerged, allowing yourself to be less exposed while being given a wide-angle to fire from.\n   If you are lucky and spawn by the sandcastle while having the golden knife, you can jump onto the yellow room and out through the window if the other team is by the subway. You can then climb the stairs and jump down from the opening beside the red building and backstab someone."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap11.JPG",
         "name":"KITCHEN KHAOS",
         "info":"Map Information:\n Kitchen Khaos was released in the Summer Update. It takes place in a giant kitchen that is filled with random props.\n   This map is a big messy kitchen. It is a good map for trick-shooting when using the trampolines or falling from high places and/or stomping them. There is also a lot of cover in this map.\n   There was a placeholder map exclusive to private servers called Kitchen 2020, it is a revamp of Kitchen Khaos.\n Tips and Tricks:\n   Most of the fighting will occur under the table and near the spawns.\n   All of the spawnpoints except for the mousetrap spawnpoint are ideal places for camping. However, be aware that more proactive players will use the trampoline in the brick fort to try to pick you off.\n   The trampolines are extremely useful, as they allow you to get to the main spawns quickly, and also allow you to perform creative flanks.\n   Kitchen Khaos supports almost every playstyle. If you like camping, sit around at spawn.\n   While all of the spawns are viable camping spots, the cabinet spawn near the sinks is arguably the best one, as you get the best view of the place.\n   The Knife is incredibly useful in this map when taking the trampolines into consideration.\n   Weapons that can boost jump are particularly useful in this map, allowing ease of movement without the use of trampolines. This can catch opponents off guard easily since most would expect people to fly near the trampolines.\n   Normally, in 2 teams, you would spawn either side of the map. If you get the spawn near the grill and see some campers on the opposite side, go inside the little hole in the wall, follow the path, and backstab the campers."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap12.JPG",
         "name":"VILLA",
         "info":"General Information:\n   Villa is a map in Arsenal that was added in the September Update and can be played in all gamemodes with the exception of Brickbattle. It can also be played in all teams.\n   Villa takes place on a large mansion that is in the middle of the map. The mansion is noticeably empty, the only things inside are two staircases. There is also a really spacious area outside that has, a small patch of grass with a palm tree outside and next to it, a gate leading to a non-accessible staircase outside the playable area, a cliff walk on the side of the building, another set of stairs outside that is accessible, a arch way leading to a ramp that has a couple of boxes next to it, and a walk way. The mansion takes place on somewhat of a cliff edge.\n   Falling off of the map will result in you dying and losing a level, just like any other map hazard.\n Tips and Tricks:\n   Villa is an extremely small map with a few spawns. Like Sandtown, this map is extremely small and will pretty much always have a skirmish happening somewhere. Unlike Sandtown, however, Villa has more chokepoints and fewer places to simply point and shoot down. Be careful!\n   Spawns are likely to swap frequently. Like any other small map, pay attention to where your team is going and react accordingly.\n   The stairs are a particularly useful vantage point, but you shouldn't stay there for long.\n   Any area of the house can be considered a kill-zone, considering how closed the place is. Be ready for either sudden kills or sudden deaths, you never know what could happen.\n   Since there are so many closed areas, Villa is an ideal map for practicing/performing trickstabs. If you can react and/or predict an enemy's moves, you can skillfully maneuver and demote them accordingly.\n   The roof is a very strong vantage point and is usually accessed through boost jumping. If you manage to get up there, camp and use it while you can.\n   While boost jumping is the easiest way to access the roof, there is a lesser-known path involving the balcony near the big staircase. Simply jump on the railing, then crouch jump onto the roof.\n   The Golden Knife is easier to use on this map compared to others. With its high speed and double-jump capability can allow you to access the roof through unconventional means, allowing you to easily flank other enemies. Trickstabbing is viable too, as the abundance of closed spaces works to your advantage.\n   It is highly recommended to take alternate routes on this map since most of the battles happen inside the house, and you can get easily spawn-camped.\n   Shotguns are very viable on this map since the map is very closed and there is plenty of corridors and small rooms."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap13.JPG",
         "name":"GLACIER",
         "info":"General Information:\n   Glacier, originally called Glacier Outpost[1] is a map that was released on 12/23/19 and was originally in private servers. The map takes place in a small base camp in the North Pole on a huge glacier. There are multiple small cabins on top of a frozen glacier with multiple survival notes.\n Crystal Mine Operation Story:\n   In this map, there are notes inside two cabins which are actually a long story if you combine them.\n   Mechanic and Brute with a crew of 17 Arctic Excavators planned on mining crystals, which Mechanic described them to be great power source. Mechanic was operating the radio and Brute is the medic as Mechanic told him to set up medkits in the medic cabin, which Brute thought was unnecessary.\n   Day 15 of the operation, 3 crew members disappeared because of a giant wave crashed against the glacier.\n   Day 52, it is revealed that they are apparently going to use crystals to make RoboDelinquent.\n   Day 98 of the operation, all crew members disappeared in the night except Brute. The radio seems to be broken and Mech tries to make it work again so he can call people to take them back home.\n   Day 104 of the operation, Brute has gone missing as he went to check on cavern on Friday.\n   Day 129, Mechanic is getting cold and equipment starts acting strange because of weather.\n   Day 138, Mechanic is now alone on the iceberg and trying to search for Brute, but he couldn't find him.\n   The final moment of Mechanic on the next day, he was hiding under the desk while something was in his cabin writing a note but couldn't finish it due to someone catching him."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap14.JPG",
         "name":"MIDTOWN",
         "info":"General Information:\n   Midtown is a map that takes place in the downtown of an urban community. The map is a community-made map that was originally only available in private servers. The map is rather open but makes use of elevation and buildings to break sightlines and add areas for play. There are also multiple okapis to hide and several ramps leading to rooftops.\n   The map features a substantial amount of buildings surrounding an area fulfilled with vehicles. There is also multiple advertisement signs with a silver border. A building is placed at the right side of the map along with a pit that is accessible to players.\n   This map is used to activate the Slaughter event.\n Map History:\n   03/16/20: Added into the game of Arsenal in private servers.\n   03/18/20: Added into the public rotation.\n   01/16/21: Added a ROLVe logo sign at one of the buildings.\n   02/03/21: Added a desktop, a breakable traffic besides the ROLVe sign building.\n Trivia:\n   There are many advertisements scattered around the map including Awesome Soda, One Phone, BOX, The Tunnel, Bloxy Cola and the iconic Banana.\n   There is a pillar of credits to the map developers.\n   The map has a reskinned yellow semi-truck found in many previous Arsenal maps.\n   There is a decal of Chaseroony. The decal object's name is NOT an idiot.\n   There is also a decal of KonekoKitten and a dog named Corgi.\n   Near the double scaffolding, there is a wanted poster. The bounty? Some dude, for 999R$."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap15.JPG",
         "name":"TUSCAN",
         "info":"General Information:\n   Inspired by Italian architecture, Tuscan is a moderately sized urban map and is somewhat asymmetrical and symmetrical that follows a three-lane rule, much like a Counter-Strike map. Both sides of the map are almost symmetrical with minor differences. Both alleys have the same layout with minor color changes. The middle section of the map is filled with a brick road and connected to via four alleys and two interiors. One interior is an eatery named da Vinci Diner, the other is an unnamed clothing shop.\n Tips and Tricks:\n   Ah yes, a beautiful afternoon in Italy. What's that? Bullets flying over your head? Quick! Survive!\n   The center of the map is where the most action is. Be prepared.\n   If you have the Golden Knife at spawn, jump on the fence, then jump on a tree. You then can access the roof and watch above for your victim.\n   Shotguns can be quite useful if you are raiding a spawn.\n   Rocket/Recoil Jumping is useful and is easy to go from one side to the other side of the map.\n   Using alternate routes can help flank opponents.\n Map History:\n   03/20/20: Added into the Showtime! Update of Arsenal.\n   03/21/20: Fixed glasses for out of bounds buildings.\n   05/16/20: Added a obby as part of the Coffee quest.\n   06/21/20: Optimized skybox textures.\n   08/28/20: Added decorations and balloons then later removed.\n   10/26/20: Changed map theme to Halloween and removed the Coffee Quest.\n   11/20/20: Reverted back to normal and re-added back the Coffee Quest.\n   01/09/21: Fixed a bug where buildings were all fully red."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap16.JPG",
         "name":"MATRIX",
         "info":"General Information:\n   Matrix is a map that was released in the Sci-Fi Update. The map mostly consists of grids, blocks, wedges, and crates studs.\n Tips and Tricks:\n   Using the second floor of the building can help when you have the Golden Knife.\n   The 4 corners of the map are covered, you can easily spawn-kill in here.\n   The 4 corners can be used to flank enemies.\n Trivia:\n   The map begun its development on September 6th, 2020.[1]\n   The update logs mentioned that the map was locked to 2 teams. But actually, it was not the case.\n   The map showed most of the parts' studs:\n   Some of the blocks are 3x3 and 6x6.\n   The crates are 3x3.\n   The Rolce railings are 12.\n Map History:\n   09/29/20: Added into the Sci-Fi Update of Arsenal.\n   11/20/20: Added one more crate to the map.\n   01/04/21: Added an extra spawn to Free For All.\n   02/03/21: Removed the two-way spawn."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap17.JPG",
         "name":"ROLVE STATION",
         "info":"Map Information:\n   ROLVe Station is a map in Arsenal that takes place inside of a Sci-Fi spacecraft. It has teleporters around the map, marked as 1, 2, 3 and 4. It is an open map with two floors.\n Tips and Tricks:\n   Use teleporters to quickly navigate around the map.\n   Attack enemies from above.\n   Flank someone with the Golden Knife by using the teleporters to surprise attack someone near the teleporter.\n Trivia:\n   The map was originally called Facility.\n   This is the first map to feature teleporters.\n   Outside the map, there are some asteroids around the station.\n   If a player's graphics setting is at least four or above, PrimE can also be seen outside of the map.\n   There is a glitch/bug where if the game lags frequently, the teleporters will not teleport a player upon stepping.\n Map History:\n   09/29/20: Added into the Sci-Fi Update of Arsenal.\n   02/05/21: Changed menu background."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap18.JPG",
         "name":"CANALS",
         "info":"General Information:\n   Canals is a map released on October 31, 2020 as part of the Halloween Update II.\n   The map features destroyed vehicles scattered around and an small town connected via an bridge, and the spawnpoints located in opposite sides of the map. The water will demote players if they go out of bounds.\n Tips and Tricks:\n   Players can snipe unsuspecting players by Rocket/Recoil Jumping into buildings and sniping the players who are walking in the bridge.\n Trivia:\n   The map was featured in the DevForum post when it was going to be added an week later.\n   The map was listed as Spooky Canals in the update logs.\n   A poster about the Cawfee Emote was founded here.\n Map History:\n   10/31/20: Added in the Halloween Update II: Part II of Arsenal.\n   01/01/21: Removed from the public rotation.\n   03/16/21: Re-added back to the public rotation.\n   The map now takes place on daylight.\n   Removed most of the Halloween variants.\n   Fixed collision issues with vehicles and foreground props and minor void gaps.\n   New map named CanalsHalloween that features the map with all the Halloween variants.\n   04/04/21: Added a new icon."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap19.JPG",
         "name":"DUSTSTORM",
         "info":"General Information:\n   Duststorm is an Arsenal map which was first added in private servers on Christmas Update II: Part I for testing, it was later put on rotation during part II.\n Tips and Tricks:\n   In the spiral staircase, there is a ladder leading to the roof which provides a great vantage point for shooting.\n   A downside to this however is that you can easily get flanked while on the roof since you can't look down because the cover blocks your view.\n Trivia:\n   The map begun its development on August 21, 2020.\n   The map can be played here.\n   Much like Christmas Dinner, Winter Park and The Mines, MyFootLettuce was left uncredited on the Twitter post announcement due to Krystal Flynn being given a list of map creators by EMIRPEIRF excluding Foote.\n Map History:\n   12/13/20: Added into the Christmas Update II: Part I of Arsenal as a private servers-only map.\n   Fixed bug.\n   12/14/20: The map now display the map creators.\n   12/17/20: A minor update:\n   Enlarged the map.\n   Moved spawn points and added covers to prevent spawn camping.\n   The cliff was stylishly updated.\n   Added a secret green cube.\n   12/23/20: Removed the get the Monky skin hidden room and moved the button at the left side of the Monky room.\n   12/24/20: Added into the public rotation.\n   The Monky room is now removed.\n   01/04/21: Improved ladder collisions."
      }
   ],
   "brickbattlemaps":[
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/brickbattlemaps1.JPG",
         "name":"BLOXBURG",
         "info":"Map Information: \n    Bloxburg was a map that is in the Brickbattle gamemode. It was featured in the original ROBLOX Battle and was created by Games. This map takes place in a city and a plaza. Much like many other Brickbattle maps, some of the parts can be blown up by explosives.\nThis map was removed from Arsenal along with Brickbattle gamemode in Halloween Update.\n Map History: \n    01/11/19: Added into Arsenal.\n02/09/19: Accidentally removed from Arsenal.\n02/16/19: Re-added back to the game of Arsenal.\n10/24/19: Removed from the public rotation."
      },
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/brickbattlemaps2.JPG",
         "name":"CROSSROADS",
         "info":"Map Information:\n    Crossroads is a map in the BrickBattle gamemode. Many parts of the map can be blown up by explosives. It is based on a former popular ROBLOX game of the same name developed by early ROBLOX staffs. Initially, all of the spawn points and a few structures from the map were removed for Arsenal.\nThis map was removed from Arsenal along with Brickbattle game mode in Halloween Update.\n    Map History: \n 01/11/19: Added into Arsenal.\n02/09/19: Accidentally removed from Arsenal.\n02/16/19: Re-added back to the game of Arsenal.\n10/24/19: Removed from the public rotation."
      },
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/brickbattlemaps3.JPG",
         "name":"CHAOS CANYON",
         "info":"Map Information:\n Chaos Canyon is a map featured in the Brickbattle gamemode. It was created by Shedletsky and community members in 2007. It was used for a Brickbattle type game on the ROBLOX profile. The map takes place on a canyon called Desolation Valley, there's thin walls, a bunker, a exterior-column and two specific towers. Much like many other Brickbattle maps, some of the parts can be blown up by explosives.\nThis map was removed from Arsenal along with Brickbattle gamemode in Halloween Update.\n Map History:\n   01/11/19: Added into Arsenal.\n02/09/19: Accidentally removed from Arsenal.\n02/16/19: Re-added back to the game of Arsenal.\n10/24/19: Removed from the public rotation."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/brickbattlemaps4.JPG",
         "name":"RAVENROCK",
         "info":"Map Information:\n   RavenRock is a map in the BrickBattle gamemode. It was also seen in the classic ROBLOX Battles. The map features a market, a large Elizabethan house, a stairway, two bridges and an abandoned house. Some of the instructs can be destroyed by the RPG or the Bomb.\n This map was removed from Arsenal along with BrickBattle game mode in Halloween Update.\n Trivia:\n   The map was used in original ROBLOX Battles created by Games.\n Map History:\n   01/11/19: Added into Arsenal.\n 02/09/19: Accidentally removed from Arsenal.\n 02/16/19: Re-added back to the game of Arsenal.\n 10/24/19: Removed from the public rotation."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/brickbattlemaps5.JPG",
         "name":"SKYLANDS",
         "info":"General Information:\n   Skylands was used in Brickbattle gamemode, the fight took place in the sky. The map was made by Games and Stickmasterluke. It was used in the original ROBLOX Battles. This map takes place on floating islands, the map is very open and has a huge bridge in the middle of the map.\n This map is also completely removed from the game, and cannot be accessed in private servers. Originally, this was able to be played in private servers.\n Trivia:\n   This map was huge and it could be called the biggest map in the game ever.\n The islands float in the air, however, the bridge does not. It is attached to the bottom of the map.\n This is the one of the two Brickbattle maps not to be created by Shedletsky.\n This is also the only Brickbattle map to be created by Stickmasterluke.\n Map History:\n   01/11/19: Added into the Brickbattle Update of Arsenal.\n 02/09/19: Removed from Arsenal."
      }
   ],
   "reskinnedmaps":[
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/reskinnedmaps1.JPG",
         "name":"HEIGHT FRIGHTS",
         "info":"General Information:\n   Height Frights takes place in an open-ended map set in a theme park surrounded by a castle at dawn. Areas mix of long to close-ranged combat with most encounters near the drop tower & gamer grill stalls.\nHeight Frights features one roller coaster, two flat rides, and a couple more shop & game stalls.\n Tips and Tricks:\n   There are many high vantage points. These include:\nThe Ferris wheel, the most used, the easiest, and most useful vantage point to use, as hiding in the car not only shields you from damage, but it also gives you a nice view, allowing you to fire upon any unsuspecting players.\nAny and all of the roofs present on the map.\nThe top of the dropping machine ride, the highest point on the map.\nThe trees, not commonly used but still useful nonetheless.\nThis map is very open, making snipers and straight-shooting weapons ideal. Weapons that can boost jump are also especially useful considering the many height vantages.\nThe top of the dropping machine is the highest point in the map, making it useful for sniping, but not ideal for other weapons. It's hard enough to get there anyway, so stick to other spots. Unless you want to meme or pick off enemies from longer ranges, then go for it.\nThe roller coaster is a strange feature of the map. You'll likely not hit any of the enemies while on it, but they likely won't hit you either. Getting hit by the roller coaster will count as an environmental death and will likely demote you. Note that if you exit the roller coaster while the roller coaster is still moving you will be demoted.\nYou'll have a particularly hard time securing a kill with the Golden Knife in most situations on this map. Try to take alternative routes or drop from a high place to give yourself the best bet at winning.\nFlanking is practically impossible, so you would have to rely on direct combat. Weapons that have a good movement speed to get to the front line faster with straight-forward shooting like the MP9-S will strive well."
      },
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/reskinnedmaps2.JPG",
         "name":"SAFEHOUSE",
         "info":"Map Information:\n Safehouse takes place in a hilly woodland area with a craftsman styled house as the focal point. The map is inspired by the CS:GO map, de_safehouse, but has a different layout outside of the house.\nMultiple rocks, rocky terrain, and trees make it a extremely dynamic map, providing natural cover or vantage points. A cobblestone wall blocks the two sides of the map, however there are some ways around it, with there being a shed that you can climb over to get to the other side, and a 2 planks on the other.\n Tips and Tricks:\n   Safehouse is the most straight forward map of all of the maps. With an open spawn area and a closed house area, a skirmish is likely always happening on this map.\nMost players will try to get as many kills as possible going through the main hallway and the kitchen. If you want to get the drop on them, go through one of the windows and flank.\nThe roof is a very strong vantage point, especially if the enemy is spawning in the lower spawns. If you get there, exploit it to its fullest potential.\nIf you want to avoid the house in its entirety, go to the walls and use the planks to flank the enemy.\nThe lower spawn is possibly the worst area to be in on this map. It is, quite literally, an uphill battle from there. Work with your team to push and regain the upper spawn, then turn the tables!\nThe stairs are a nice section to camp on if the enemy is spawning from the upper spawns. Since most of them will be looking down the hallway, pick off any unfortunate souls, then book it once you start getting shot at.\nThe roof, the trees, and the large window on upper-spawn side of the house can be used to get the drop on anybody walking into the hallway. This is especially useful when you're on the Golden Knife.\nWhich is that you're likely to have a hard time getting a kill on this map unless the person you're chasing is inside the house. Use any of the flank routes mentioned above, and win!"
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/reskinnedmaps3.JPG",
         "name":"STREET CORNER",
         "info":"Map Information:\n   Street Corner takes place at a residential street. It is a very close-quarters orientated map. Most fights are close-quarters engagements. As can be gleaned from the picture, Street Corner has a road in the middle.\n The environmental hazard within Street Corner is the occasional traffic speeding through the street. Players who get hit by one of these cars can be killed.\n Street Corner also has a sewer, which is an L-shaped corridor with two levels, accessible by ladder. The sewer is a very popular part of Street Corner, due to the spawns within and easy to access routes to its location.\n Tips and Tricks:\n   If you want to find an alternate route, the most obvious are above the sewers, where you can flank.\n Spawns tend to be very random and will mix up so be wary and check all possible spawns, at the end of the sewers, entrances to the sewers, and more.\n Trivia:\n   Street Corner was originally made for Trouble In Robloxity, a removed ROLVe game.\n This map was originally set more in the day-time when it was first released however it was removed on the same day.\n Players could walk into the sewer duct underground, which caused a cutscene that featured your avatar coming out of the door of the red building next to the bakery to play, as well as a flushing sound. When the cutscene ended, players would end up above the surface. It was used to be removed until it returned in the Summer Update II.\n When the game begins, one team would spawn inside of sewers while the other team would spawn behind the small building and near the broken sidewalk of sewers.\n There is a winter variant of this map named Cold Corner.\n Map History:\n   02/26/19: Added and removed from Arsenal.\n 03/09/19: Re-added back to Arsenal.\n 06/05/19: Collision fixes for Street Corner.\n 12/14/19: Renamed to Cold Corner for Christmas and changed map theme.\n 02/06/20: Reverted back to Street Corner.\n 05/17/20: Added a valve and the black hole at the sewer as a part of the Dundertale quest.\n 06/20/20: Changed Street Corner's menu view, removed fence, Dundertale quest, and re-added back the secret door.\n 12/16/20: Changed back to the Cold Corner theme and re-added back the fence.\n 12/17/20: Re-added back Street Corner to the public rotation.\n 12/18/20: Removed the fences from Cold Corner.\n 12/19/20: Re-added back Cold Corner and a major update:\n Minor optimizations.\n Improved sewer ladder reliability.\n Fixed missing chair leg.\n 02/03/21: Reverted back to Street Corner.\n 03/16/21: Fixed cars not killing players.\n 05/04/21: Fixed cars not killing players."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/reskinnedmaps4.JPG",
         "name":"SNOWSIDE",
         "info":"Map Information:\n   Hillside was released in the 2.6 Update. Hillside takes place in a lakeside park, with a cluster of buildings on top of the hill. There are tunnels on both sides of the map to connect the pathways. The terrain is rough outside the buildings leaving one team to fight up the hill.\n There is almost no cover in this map, so players cannot hide behind a wall to avoid being hit. This will most likely result in very quick deaths, so players must try to get as many kills as possible before dying. This map relies on brute-forcing attacks, where the most successful player is the one that can get the most kills within a short time span.\n Tips and Tricks:\n   Hillside is a fairly large map. Try to flank as much as possible so you could eliminate players by surprise.\n Long-range weapons strive on the hill part while close-range weapons strive in the corridors\n Like the first tip, it is a fairly large map, and flanking could take a while. The PIZZA can be useful in this situation, giving you the speed boost and allows you to catch up to opponents, probably the easiest way to get a knife kill.\n Trivia:\n   The entirety of the map's development was streamed, and was created in a few days.\n Hillside used to be able to host FFA games, but this was removed due to the lack of places for players to spawn without being spawn-killed.\n Only one building is accessible, a gift shop, which uses assets from Stinky's Coffee shop from Boulevard.\n The gift shop has a micro-toilet on the shelf after a viewer requested it.\n There used to be a Gurt easter egg but it was removed.\n Gurt was the pig and the mascot for the Egg Hunt 2018 event.\n As of March 21st, 2019, Hillside is the only map in Arsenal to use triangle terrain.\n On September 28th, 2019, the map has received an autumn makeover.\n In private servers, there was a Hillside-Green version.\n On February 4, 2019, there was a lightning rework on the map.\n A different icon was used for a couple days with a new lighting, however later was reverted to the old icon.\n Map History:\n   02/27/19: Added into the game of Arsenal.\n 09/28/19: Changed map theme to autumn.\n 12/14/19: Renamed to Snowside for Christmas and changed the map theme.\n 02/06/20: Reverted back to Hillside.\n 02/13/20: New icon reverted.\n 06/20/20: Added secret entrance, dead cow and hint as a part of the Cryptid Hunt.\n 10/25/20: Removed the secret entrance, dead cow and the Cryptid Hunt hint.\n 12/16/20: Changed back to the Snowside theme.\n 02/03/21: Reverted back to Hillside."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/reskinnedmaps5.JPG",
         "name":"AIRCRAFT",
         "info":"Map Information:\n   Aircraft is a map released in the Summer Update. The map takes place on an aircraft carrier filled with shipping containers parked next to an island with a volcano. Players can enter the air-traffic control tower and bridge, which features catwalks, a meeting room, and destroyable windows. Out of the playable area, there are fighter jets lined up as if they were ready to take off.\n Tips and Tricks:\n   Use crates to gain height advantage and allow yourself for more flexibility in movement unlike the long walkway on the second or third level of the ship.\n Fights will often be in cramped spaces, try to pre-fire around corners to land the first shots if you run into someone.\n The first level of the ship has hallways that leads to other parts of the map.\n Trivia:\n   The map begun its development on February 17, 2019.\n This map can be played here.\n The background is a ROBLOX decal.\n It is the first map to take place in the middle of the ocean.\n It is one of the first maps to have destructible windows along with Beach.\n The pirate ship decal used to be on the map, however, it was removed.\n In private servers, there is a map called, Aircraft (Alt).\n The only difference from this map to the original is that you cannot obtain the fire golem skin on Aircraft (Alt).\n Map History:\n   06/05/19: Added into the Summer Update of Arsenal.\n 08/25/19: Aircraft water and background boat removed.\n 01/04/20: Updated the detailing of Aircraft to make it perform better on lower graphics settings and one of Aircraft's ladders are fixed.\n 06/20/20: Added meteor and hint as a part of the Cryptid Hunt.\n 10/25/20: Removed meteor and the Cryptid Hunt hint.\n 10/26/20: Changed map theme to Halloween.\n 11/20/20: Reverted back to normal."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/reskinnedmaps6.JPG",
         "name":"TUSCAN",
         "info":"General Information:\n   Inspired by Italian architecture, Tuscan is a moderately sized urban map and is somewhat asymmetrical and symmetrical that follows a three-lane rule, much like a Counter-Strike map. Both sides of the map are almost symmetrical with minor differences. Both alleys have the same layout with minor color changes. The middle section of the map is filled with a brick road and connected to via four alleys and two interiors. One interior is an eatery named da Vinci Diner, the other is an unnamed clothing shop.\n Tips and Tricks:\n   Ah yes, a beautiful afternoon in Italy. What's that? Bullets flying over your head? Quick! Survive!\n The center of the map is where the most action is. Be prepared.\n If you have the Golden Knife at spawn, jump on the fence, then jump on a tree. You then can access the roof and watch above for your victim.\n Shotguns can be quite useful if you are raiding a spawn.\n Rocket/Recoil Jumping is useful and is easy to go from one side to the other side of the map.\n Using alternate routes can help flank opponents.\n Trivia:\n   This map is the eighth map that was created by TCtully for Arsenal.\n This map was first shown on TCtully's Twitter.\n Players can travel through the outside of the map by using the Coffee Quest entrance.\n ROLVe added balloons and decorations into this map to celebrate TCtully's birthday.\n Map History:\n   03/20/20: Added into the Showtime! Update of Arsenal.\n 03/21/20: Fixed glasses for out of bounds buildings.\n 05/16/20: Added a obby as part of the Coffee quest.\n 06/21/20: Optimized skybox textures.\n 08/28/20: Added decorations and balloons then later removed.\n 10/26/20: Changed map theme to Halloween and removed the Coffee Quest.\n 11/20/20: Reverted back to normal and re-added back the Coffee Quest.\n 01/09/21: Fixed a bug where buildings were all fully red."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/reskinnedmaps7.JPG",
         "name":"SPOOKYTOWN",
         "info":"General Information:\n   Spookytown was added in the Halloween Update II, and was removed on October 7, 2020. It takes place in a carnival-like area.\n Tips and Tricks:\n   Sandtown, being one of the smallest maps in the game, means there will always be a firefight somewhere on the map, no exceptions. With constantly shifting spawns, bullets flying from every corner, this map promises never-ending action gameplay.\n Spawns are likely to shift at any given moment and pay attention to where your teammates are heading and figure out where the enemy is going to come from next.\n While heights are often a huge advantage in other maps, in Sandtown, it is relevant. The small map size means that the enemy could come from anywhere. The only option is to stay on your toes and eliminate anybody who crosses your path.\n Explosives and shotguns are useful on this map. Enemies are likely to press their faces against the camera or bunch up constantly, so take advantage of those situations!\n The plane is a viable camping spot, but as stated before, you're likely to either fall behind or get picked off.\n You can walk on the clotheslines by platforming on the arch near the building spawn. While it might not be too useful, since it leaves you open, it's good if your opponents are focused on where your teammates are. Flank them and secure kills.\n The Golden Knife is extremely dangerous in this map, since the wielder can quite literally jump from anywhere with its double jump capability. It has many parkour queues. If you happen to get your hands on it, platform onto a higher spot and get the drop on an unsuspecting enemy. Preferably, a rooftop.\n The middle of the map is usually where the fights go on play, go seek for higher heights to not be part of it.\n The building that looks over the entire center of the map can easily be ambushed if you fail to keep track of the stairs. Check the route on the side to quickly deal with flankers.\n Trivia:\n   Sandtown is a recreated version of the map with the same name from the mobile shooter game Respawnables.\n Sandtown is one of the only maps to be locked on two teams. Another map on two teams is Dizzy.\n An animation for the airplane crashing into the building was added in the second Summer Update.\n Originally, there were wanted posters in the map, however, they were removed.\n The fallen airplane wing used to have a skull spray-painted on it, this was removed as well.\n Prior the Summer Update II revamp, a moped from Work at a Pizza Place, a game on ROBLOX was featured on the map.\n During the release of the revamp, players were able to enter the house in the middle of the map. Unfortunately, it was blocked the following day because the developers changed their minds.[1]\n Spookytown is the only reskin of a map to have coexisted with said map in the voting pool.\n During the Gun Game era, a unknown metal wall can be seen blocking the entrance on one of towers.\n Map History:\n   09/12/15: Added into Gun Game.\n 02/04/16: Removed from Arsenal.\n 07/06/17: Re-added to the archived version of Arsenal.\n 12/16/18: Sandtown is forced on two teams.\n 06/05/19: Skyboxes raised.\n 06/06/19: Adjusted lighting.\n 06/09/19: Minor collision fixes on Sandtown.\n 12/23/19: Icon updated.\n 06/20/20: Revamped in the Summer Update II of Arsenal.\n 06/21/20: A minor update:\n More improvements.\n Fixed plants and window.\n Stairs now have the DIY glide.\n Optimized skybox textures.\n 10/31/20: Name changed to Spookytown and changed theme to Halloween.\n 11/01/20: A minor update:\n Changed sky to night-time.\n Collided the entrance behind the stairways building.\n Received a new icon.\n 11/02/20: Removed the ghost of hitboxes.\n 11/07/20: Re-added back Sandtown to the public rotation.\n 11/20/20: Removed Spookytown from Arsenal.\n 12/19/20: Optimizations:\n Replaced some barrels.\n Patched some objects that weren't rendered on the lowest setting.\n Less shadows drawn.\n 12/24/20: Optimized skybox.\n 05/11/21: Added 4 bananas around the map."
      }
   ],
   "removedmaps":[
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/removedmaps1.JPG",
         "name":"EASTERN",
         "info":"Map Information: \n Eastern is a legacy map from Pre-Filtering Enabled Arsenal. It was removed from Arsenal in early 2016, but was added back as a private server-exclusive map later on for the revamp of Arsenal.\nBoth teams spawn on opposites of the map and clash in this long corridor type map. The entire map seems to take place in an apocalyptic highway or road. The middle area has some ladders, scaffolding, platforms, fences and road barriers while the red and blue areas have mini blocky buildings and burning, destroyed cars. Also throughout the map, there are arches with cones on the top of them."
      },
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/removedmaps2.JPG",
         "name":"BANK",
         "info":"Map Information:\n Bank is a legacy map from Pre-Filtering Enabled Arsenal.\nThis map is a replica of the de_bank map from Counter-Strike: Global Offensive. It was removed from the Arsenal map rotation in mid-2016.\nThe map features the main bank, which is having restorations, because of this, there is a ladder to the top of the building. Inside the bank, there is a lobby that features little decor. Next to the bank, there is a industrial building with a truck that has skidded off course. There are other buildings on the opposite side."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/removedmaps3.JPG",
         "name":"VERTIGO",
         "info":"General Information:   de_vertigo is a legacy map from Pre-Filtering Enabled Arsenal. However, this map was in the game for a short amount of time and was removed.\n   The map takes place on a skyscraper that is undergoing construction.\n   Vertigo is a map where one spawn-point is outside and the other is on the inside. There is various boxes and crates as well. Think of it like the map, Metro, except with multiple floors. There are also many chokepoints. \n Trivia:\n   Near the top of the skyscraper in one of the windows, there is a human face.\n   The buildings on the outskirts of the map were possibly reused in the map, Agency.\n   This map is the recreated version of the Counter Strike: Global Offensive map of the same name.\n   The map was also taken from Counter Blox: Roblox Offensive, another ROLVe product.\n   The map in CS:GO was reworked on January 28, 2019, making it now inaccurate to this version.\n   This is the third map to not be exclusive to private servers after their removal, first being Canyon, second being Bank, fourth being Aztec, fifth being Delta (before the revamp), sixth being Nuke Bunker, seventh being original Safehouse.\n Map History:    \n04/19/16: Added into Gun Game.\n   04/26/16: Removed from Arsenal."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/removedmaps4.JPG",
         "name":"NUKE BUNKER",
         "info":"Map Information:\n   Nuclear Bunker, also named Nuke Bunker, is a legacy map that was in Pre-Filtering Enabled Arsenal.\n   The original version of the map had players spawning on each side of the map, leaving a wall in between them. Most players would fight at the end of this barrier, but if someone made it to the nuclear bunker, they could activate the nuke and blow up the map. Detonation would close the blast doors and kill everyone outside of the bunker with a white flash. Anyone inside the bunker would live. The game continued normally after this.\n   The revamped version of the map was briefly available in Arsenal during 2018. The map layout is very different, but still features the bunker on one side of the map. The map features buildings from Assault and now has a park and battlements. The nuke can no longer be activated.\n   Neither version of the map are playable now and have been removed from the game.\n Trivia:\n   This is the sixth map to not be exclusive to private servers after their removal, first being Canyon, second being Bank, third being de_vertigo, fourth being Aztec, fifth being Delta (before the revamp), seventh being original Safehouse.\n Map History:\n   08/18/15: Added into Gun Game.\n   04/21/16: Removed from the ALPHA phase of Arsenal.\n   December 2018: Added and later removed from Arsenal."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/removedmaps5.JPG",
         "name":"BIG KITCHEN",
         "info":"Map Information:\n   Big Kitchen was a short-lived map that took place in an oversized kitchen. Fights usually resorted to fighting on the floor and snipers would take aim on top of the pantry and cupboard. It also featured a Holy Bible.\n   Big Kitchen was removed in December 2018, but can still be played on private servers with the command menu.\n Trivia:\n   Falling into the sink or onto a sponge cancels out fall damage.\n   A remake has been made by IcyTea named Kitchen Khaos.\n   This differs from Kitchen Khaos by reaching to the top of a cabinet is from the elevator and not a ladder and lack of detail.\n   The initial version of the map can be played in the Arsenal 2018 1.0 game.\n   The environmental killers in this map are the stove burners and the toilet.\n   The map was created by loleris, who is known for making former popular ROBLOX games like The Mad Murderer and Mad Paintball.\n   A very first version of Big Kitchen can be found on one of DevRolve's old projects, MAD Wars.\n Map History:\n   11/27/18: Added into the Mega Update of Arsenal.\n   12/01/18: Fixed getting soft locked when getting killed by the hazard.\n   12/07/18: Fixed ladder.\n   12/22/18: Removed from the public rotation."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/removedmaps6.JPG",
         "name":"SUBWAY 2018",
         "info":"Map Information:\n   Subway is a community-made map by Omnisxiii2, with art from Alyx S & Josh V, but the art could not be found.\n   Subway takes place in an underground abandoned subway. It is a very tight map consisting of long corridors and sharp angles perfect for sniping and camping. It features access to the train tunnels and to street level, but access is limited.\n   There are a few dead ends in the map, however, there is a circular flow to the map on a designated path.\n   This map was in the archived version of Arsenal, however, it was removed.\n Trivia:\n   The map's model can be view here.\n   Subway wasn't implemented after the Mega Update, it was added much later. After a couple of weeks, the map was re-shelved.\n   Subway was originally going to be called Subterra.[1]\n   An art from Alyx S. & Josh V. was used, however, it couldn't be found.\n   The subway trains appear to be slightly off the track.\n   Despite being called Subway 2018, it was actually created back in 2016 and remastered in 2019.\n Map History:\n   05/12/16: Added into the ALPHA phase of Arsenal.\n   08/10/16: Removed from the archived phase of Arsenal.\n   01/19/19: Re-added back to Arsenal.\n   02/16/19: Removed from the public rotation."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/removedmaps7.JPG",
         "name":"CACHE",
         "info":"Map Information:\n   Cache was a map that was formerly in the game before being removed in the July Update. It is a recreated version of the same map in Counter-Strike Global Offensive and Counter-Blox. Unlike the original map in Counter-Strike, many areas have been modified to fit Arsenal's style of gameplay.\n   This map takes place in a city near the Chernobyl Power Plant.\n Trivia:\n   This map was in Counter Blox: Roblox Offensive for awhile until the CB:RO rehaul was released in 2017, where certain people remade Cache altogether.\n   This map was made by a developer who is no longer in ROLVe.\n   Currently, AdministratorGnar is the owner of PLATINUM FIVE and is working on Blackhawk Rescue Mission 5.\n Map History:\n   04/21/16: Added into the ALPHA phase of Arsenal.\n   08/10/16: Taken to the archived phase of Arsenal.\n   11/27/18: Taken to the Mega Update of Arsenal.\n   07/05/19: Removed from the public rotation."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/removedmaps8.JPG",
         "name":"67TH WAY",
         "info":"Map Information:\n   67th Way takes place on a suburban street and contains two tunnels, a big house, a prison, a gun shop, and a building that is under construction.\n   Cars occasionally drive along the street at a high speed and can kill players upon any sort of contact with them. If a player is killed by the cars, they likely will be demoted unless an enemy tagged them prior to their death.\n Trivia:\n   This was the first map to have moving obstacles pass through the map that could kill the player. Other maps include Boulevard, Street Corner and Subway.\n   As of now, the cars on both directions are currently broken.\n   The map is a recreated version of the map with the same name in Garry's Mod.\n   There is also a hidden underground bunker and a farm area in the map that can be seen through free-spectating.\n Map History:\n   01/15/19: Added into Arsenal, added clips, and fixed ladders.\n   01/29/19: Changes to 67th Way.\n   02/25/19: Removed from the public rotation.\n   07/05/19: Re-added to the public rotation.\n   10/28/19: Removed from the public rotation."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/removedmaps9.JPG",
         "name":"DELTA",
         "info":"Map Information:\n   Delta is a legacy map that was made alongside the Pre-Filtering Enabled Arsenal. It was removed from the game in 2016. However, it was re-added in the Anniversary Update and was reworked, but then removed again.\n   It takes place in a compact paintball arena. The map features two spawn rooms, one for blue, one for red, players spawn here and then battle it out in the corridors. The map is mirrored so both sides are the same with some slight differences in prop placement.\n Tips and Tricks:\n   Treat this map like Dizzy, albeit bigger with many, many more chokepoints. The amount of cover present always ensures you'll either kill quickly or die quickly. Because of this, rounds on this map tend to either go really fast or somewhat slowly. Always be prepared here!\n   Shotguns are extremely useful in this map, as you'll almost always engage in close-range combat.\n   The center area is a hub for kills and deaths, with most players never advancing to the other spawn. Because of this, the spawns are unlikely to swap, rather staying stagnant.\n   The outer section is an ideal route to take if you want to flank. Do be wary that it's very easy for an opponent to hide and pick you off if they spot you, due to the abundance of cover.\n   Weapons that can jump boost are king in this map. If you can get over the walls, you'll be able to see exactly where everyone is, and they won't have much space to move. Get jumping!\n   The Golden Knife can arguably be either the worst or best weapon for this map. Combined with its double jump, you'll have a much easier time getting past the chokepoints and jumping from cover to cover. However, since the space that most run around is so small, it's likely you'll die before you can stab the enemy. To ensure your best chance of winning, flank the enemy using the outer circle.\n   The regular knife is also pretty good for this map as well, as the small space could work to your advantage when trying to demote someone. Although the enemy is more likely to pick you off first.\n   Two words: Spy's Playground. This map is heaven if you like flanking behind the enemy and demote them or perform trickstabs, maneuvers that rely on tricking an enemy for a cheeky backstab. If you can perform these maneuvers and predict enemy movement, this will instantly become you're favorite. Stair-stabs, corner-stabs (especially), matadors, drop-stabs, understabs, and maybe even circle-stabs.\nTrivia:\n   The ALPHA and early models of the map can be viewed here and here.\n   This map has an area that shows opposite team Delinquents.\n   The top of the walls can be reached in several ways.\n   This map was one of the shortest lasting maps in the game after the Mega Update.\n   The creator of the map, back in the Gun Game time of Arsenal, was making a new map called Sand Dunes to replace this map.\n   However, it was never finished and is currently unreleased. The only thing that was finished was the Crimson spawn location.\n   This (before the revamp) is the fifth map to not be exclusive to private servers after their removal, first being Canyon, second being Bank, third being de_vertigo, fourth being Aztec, sixth being Nuke Bunker, seventh being original Safehouse.\n Map History:\n   05/12/16: Added into the ALPHA phase of Arsenal.\n   08/10/16: Removed from the archived phase of Arsenal.\n   11/27/19: Remastered and re-added into Arsenal.\n   11/30/19: Increased invisible barriers to avoid players from escaping the map.\n   12/03/19: Removed from the public rotation."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/removedmaps10.JPG",
         "name":"METRO",
         "info":"Map Information:\n   Metro is a community-made map set in an underground train station located in Russia. The map has long distanced hallways great for long-ranged weapons but also has tight connecting rooms in the middle for close-quarters action. Players can access the main station, the train, storage, utility rooms, air ducts, stores, and a cafe. The entire station appears to be under renovation. The map is divided into different levels giving a good balance of vertically leading into the tunnel. Walking through the card scanners causes a beep, which can give a players location audibly to other players.\n Trivia:\n   Metro was originally released in Counter Blox: Roblox Offensive.\n   Metro was added to Arsenal the following month after it released.\n   Metro has a billboard picture of the layout sketched on paper.\n   Metro used to have a billboard picture of an ex-ROLVe developer, near the out of bounds exit.\n   There was a mini version of Metro where some of the hallways and stores were blocked off, after the new Arsenal was released the full version of Metro was added back.\n   The metal detectors beep based on your team color.\n   Originally, this map had a different layout, and the graphics weren't great.\n Map History:\n   12/08/16: Added into the archived phase of Arsenal.\n   11/27/18: Metro revamped in the Mega Update of Arsenal.\n   12/06/18: Minor changes to Metro.\n   01/23/19: Added more routes, vent exit, less flat textures, reduced part count and gates will now make an audible beep.\n   10/28/19: Removed from the public rotation.\n   02/02/20: Accidentally re-added to the public rotation.\n   02/05/20: Removed from the public rotation."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/removedmaps11.JPG",
         "name":"SILO 20",
         "info":"Map Information:\n   Silo 20 is a map that takes place inside of an abandoned missile silo. In the center of the map, there's a giant red missile. Multiple crates are scattered across the map. It is also one of the largest maps to be created in Arsenal.\n   Originally, the map is only exclusive to private servers and had no textures and had the name of Silo 02.\n   After the map was removed, its successor, Silo 21 was created for Christmas Update II.\n Tips and Tricks:\n   In Silo 20, there are many places to flank and hide. Using these tips can help you win.\n   This map has cargo boxes around it. Follow them so you do not get lost.\n   Most action happens near the center (Where the rocket is), as it is a major chokepoint.\n   In one of the rooms, if you climb the stack of boxes at the center, it leads you to another platform. You can wait for a good time here to flank or stomp.\n Trivia:\n   This map was originally named Silo 02, however was changed to Silo 20.\n   The map was created by AzireBlox, who is a fan of the YouTuber named John Roblox and made it out of respect for his channel.\n   DJH_Dylan re-textured and revamped the whole map in a hour due to a player requesting this map being in the next update.\n   There are multiple ROBLOX spawn point models around the map in the Silo 02 variant.\n   There is a invisible wall on the both sides of the map, accessing the outside.\n   When it was first released, Silo 20 used the Lunar icon as a placeholder.\n Map History:\n   12/14/19: Added into the game of Arsenal as Silo 02 in private servers.\n   12/20/19: Added to the public rotation, renamed to Silo 20 and added more textures.\n   12/23/19: Received an official icon.\n   02/06/20: Removed from the public rotation.\n   03/16/21: Removed from private servers."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/removedmaps12.JPG",
         "name":"DUST II",
         "info":"Map Information:\n   Dust II is a recreated version of the map of the same name from the Counter-Strike series. The layout is the same, but takes liberties in its visual design. It is set in a desert climate of an Arabian climate. It can be played on all game modes except Brickbattle and Arcade and is known for its many twists and turns, allowing for camping and rapid kills. However, the map is big, and corridors/walking paths are narrow.\n   Tips and Tricks:\n   The roof is your best friend on this map.\n   Camp the gate in the middle of the map to get a lot of kills if the enemies walk through it.\nTrivia:\n   Dust II uses a lighting system known as Predetermined Radiosity.\n   This lighting causes subtle lighting in dark areas that have bright surfaces opposite to them. Players can see it clearly in some spots of the map.\n   Many of the background buildings are just flat images.\n   Dust II had ladders until they were removed in the Summer Update. However, Dust II's ladders were re-added in the August Update, but those ladder spots were different than the old one.\n   There are parts of the map with broken meshes, causing the player to run into an invisible wall.\n   Parts of Dust II are not accurate to the map within CS:GO, such as the path leading from pit to T spawn.\n   If a laggy player joins a game while at the voting screen, all three images will be blank and all 3 maps will be Dust II. It will then change back after a few seconds.\n Map History:\n   04/21/16: Added into the ALPHA phase of Arsenal.\n   08/10/16: Taken to the archived phase of Arsenal.\n   01/11/19: Dust II revamped.\n   02/15/19: Invisible bricks fixed.\n   06/05/19: Ladders removed.\n   06/09/19: Minor collision fixes.\n   08/25/19: Ladders added back but in different spots.\n   09/04/19: Tunnels fixed.\n   03/07-03/14/20: Removed from the public rotation."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/removedmaps13.JPG",
         "name":"DINER",
         "info":"Map Information:\n   Diner is a community-made map added into Arsenal by Newcoolboy3 as of February 29, 2020. It was originally in private servers.\n   The map takes place at an abandoned truck-stop diner, there are two gas station pumps with the roads blocked from abandoned vehicles. Multiple props from the map come from different maps, such as the truck from the map Boulevard.\n Tips and Tricks:\n   Diner is an easy map to memorize, since it is compact and small.\n   Most chokepoints occur by the road. Since the spawns aren't that far apart, they can swap frequently.\n   There are lots of places to hide. If you use these advantages properly, you can even flank a player.\n   Using shotgun jump to move onto the roof gives a huge advantage towards combat since there is a giant sign to protect you with.\nTrivia:\n   The map began its development on February 15, 2020, two weeks before it was eventfully added.\n   The map can be played here.\n   There are 4 notes scattered around the map, one of which is related to the lore in the Glacier map.\n   There's used to be a double-sided billboard with a picture of the Ace Pilot skin.\n   Walking too far into the tunnels can kill you.\n   On the menu, it states that the Food, Edible Stuff, and BURGER are served.\n   There's a cup of Stinky's Coffee, which was served in Stinky's Cafe in the Boulevard map, found inside the Diner next to the notes.\nMap History:\n   02/29/20: Added into Arsenal as a private server exclusive only map.\n   03/02/20 & 03/15/20: Updated to have another road, making a road at each side of the Diner, also the map is now set on night-time.\n   03/18/20: Added into the public rotation.\n   03/19/20: Removed from the public rotation."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/removedmaps14.JPG",
         "name":"LUNAR",
         "info":"Map Information:\n   Lunar is a map that was released in the Anniversary Update. The map takes place on Station 07, a space station located on the moon. It was later removed. It is the sole arcamap in the Arcade gamemode.\n   Lunar consists of one central space where both teams fight, with two outer areas where the teams spawn. Players can fight on the outside or the inside of the map. If one arrives on top of the walls, via Rocket/Recoil Jumping they will start taking 5 damage per second and an indicator will pop up on the screen, notifying that the player is taking damage. The player must be physically on the top in order to take damage, not above with some space between.\nTips and Tricks:\n   With many spots to fall off and die, a plethora of chokepoints and a strangely made center area, Lunar is a map that you'll either grow to love or absolutely despise.\n   The center height vantage is your greatest friend, as there are few areas to fall into pits up there. Land your shots and don't get hit, and you're pretty much set.\n   There are many pits in this map, one step in the wrong direction can result in a death, be careful!\n   Unlike many other maps, skirmishes do not happen often in this one. Instead, two opposing players tend to run into each other and end up killing the other. Because of this, it's imperative that you are ready for someone to jump around a corner at any moment.\n   If you happen to run into someone camping on the center height vantage, flee and try to take another route. It's almost impossible to challenge someone there. If you have teammates alongside you, then you stand a chance.\n   Explosives are your best friend in this map. Knock as many people as you can into pits and boost your score by hilarious amounts.\n   Flanking using the boost pads on the side often gets you a large kill streak.\n   The only weapon that is available in this map when you spawn is G-17. However, there are also some weapons for pickups: DB shotgun, Trench Gun, Barrett, Peacemaker, Rocket launcher and AUG.\n   Unlike other self-killing scenarios, falling into the pits will not result in demotion due to the Arcade gamemode.\n   In Arcade, shotgun jumping with the DB Shotgun will consume 5 ammo, but will have enough power to launch you to the roof. You will experience radiation on the roof floor.\n Trivia:\n   This is the first map that does not take place on Earth.\n   Outside of the map, Station 06 is visible.\n   After the map was removed along with Dust II, it was added back as the only map in the Arcade gamemode.\n   After its removal from private servers, the map is still playable in the same gamemode.\n Map History:\n   11/27/19: Added into the Anniversary Update of Arsenal.\n   12/01/19: Added clipping.\n   12/04/19: Added new spawn barriers that stay collidable for a few seconds when spawning.\n   03/07/20: Removed from the public rotation.\n   03/20/20: Re-added back to the public rotation as a part of the Arcade gamemode.\n   04/19/20: Removed from the public rotation alongside the Arcade gamemode.\n   03/16/21: Removed from private servers."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/removedmaps15.JPG",
         "name":"FACTORY",
         "info":"General Information:\n   The Factory is an Arsenal map released during the Community-Ops Update that takes place in a constructed factory. There are two sections such as one being inside the bigger factory and the second being the smaller factory along with the pavement.\n   This map's size can compare to giant maps with some close-range combat such as Boulevard. The insides of the giant factory help make close-range combat, but makes a maze to confuse players.\n Tips and Tricks:\n   The best way to not be stuck inside the giant factory is to find a ladder to have an upper ground.\n   Due to somewhat small gaps in the factory, shotguns are perfect for battling.\n   This map also features long-range combat on the pavement section and on the higher grounds.\n   A good way to get kills inside of the factory is to stay on the crates. This way, you can travel quickly as well as stay out of the maze.\nTrivia:\n   The map begun its development on April 9, 2020.[1]\n   On the Factory map, there are some forklifts with numbers that are referenced.\n   These numbers are 914, 682, 3008, 343, 2521, 708 , 999 , and 049, all referencing to the numbers of SCPs. 914 is a clockwork machine which can upgrade or degrade any object or creature placed in it, 682 being a giant indestructible lizard, 3008 being an endless IKEA store with hostile employees, 343 being God, 2521 being an SCP that must never be mentioned, 708 being an orange forklift that causes people want to ride it, 999 being a playful orange mass of slime with a dog-like behavior, and lastly 049 being a plague doctor that can turn human beings to reanimated zombies.\n   Another number reference on a forklift is 1273, which is a reference to the Tiktok trend and song, Rockefeller Street.\n   After the release of its newer version under the name of Warehouse, Factory can still be selected in private servers.\nMap History:\n   05/16/20: Added into the Community-Ops Update of Arsenal.\n   06/20/20: Removed from the public rotation."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/removedmaps16.JPG",
         "name":"BRIDGE",
         "info":"Map Information:\n   Bridge is a map taking place at a cabin somewhere in the woods. There are three bridges in total surrounding an island at a higher height than the rest of the map, which includes a linked sword set in stone, a reference to Excalibur. Not only can players access the bridges, but they can go into the water and have access to ladders that lead them back up to the top.\nTips and Tricks:\n   Bridge is one of the smallest maps in the game, and combat seems everywhere. What do you do?\n   Get to the high ground, this will allow you to spot players and shred them to pieces.\n   Consider the water area, because from the top you can destroy almost any player.\n   At the start of each game, if you spawn near the houses in front of the cave, the opposite team spawns in the cave. This allows easy spawn killing at the start of the game.\nTrivia:\n   The map originally appeared in private servers before it's initial addition.\n   Bridge, Abandoned Arena, Glacier, and Poolside appeared in private servers before their initial release.\n   This is the first map to be released in 2020.\n   In a small cave-like area, there are minecarts.\n   The low gravity feature on private servers sometimes doesn't work when you are touching water.\nMap History:\n   01/31/20: Added into the game of Arsenal as a private servers-only map.\n   02/05/20: Bridge updated.\n   02/10/20: Bridge updated and added into public rotation.\n   06/26/20: Removed from the public rotation."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/removedmaps17.JPG",
         "name":"COMPLEX",
         "info":"General Information:\n   Complex is a map in Arsenal that was released on January 15, 2019, removed upon the Summer Update's start and was added back into the game and remastered in the Anniversary Update. The map takes place in a 4-story office complex with office rooms, a storage room, and vents that can be accessed.\nTips and Tricks:\n   Such a perfect office complex in the middle of the city, right? Wrong, this complex is filled with players out to battle with their guns! The level-dependent complex can be either annoying or epic. Either way, there are strategies to master this map and unusual stuff in an office.\n   Always go to the higher levels to take advantage of enemies easier.\n   The vents can help you flank the players without getting hurt.\n   The stairs can help access to the top of the building.\n   The truss ladders on the side of the building can also help access multiple levels of the building.\nTrivia:\n   The map begun its development on September 27, 2018.\n   The map can be played here.\n   This map was originally made for ROLVe's other game, Robber, however, DevRolve liked it and decided to put it on the rotation in Arsenal.\n   In the Anniversary Update, the bottom floor part was removed by developers. This is because most players never battle at the bottom floor, so they decided to remove the bottom floor almost entirely.\n   The stairs are next to player spawns so they have access to get on the roof easily instead of rocket jumping.\nMap History:\n   01/15/19: Added into Arsenal.\n   06/05/19: Removed from the public rotation.\n   11/27/19: Remastered and re-added back to the public rotation.\n   06/26/20: Removed from the public rotation."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/removedmaps18.JPG",
         "name":"POOLSIDE",
         "info":"Map Information:\n   Poolside is a map in Arsenal that was added to private servers on June 16th, 2019. It was officially released in the July Update on July 5th, 2019. It takes place at a giant pool surrounded with multiple buildings. Poolside was re-added in the second Summer Update but was removed 2 days later.\n   It features a pool, a basketball court, a DJ Set, buildings on either side of the map, and many other unique features. It is quite larger than some of the other maps currently in the game and can be played in most gamemodes.\nTrivia:\n   The map begun its development on June 9th, 2019, 2 weeks before it was eventfully added.\n   The map can be played here.\n   Shooting the yellow plaque on the pool wall flashes up a message saying Poolside by IcyTea, a reference to one of the creators of the map, IcyTea.\n   There is a poster on the right building which shows John Brick pointing a Golden Gun saying Youre Breathtaking!. This is a reference to E3 2019 in which Keanu Reeves (who's most notable for acting in John Wick as the titular character) points at a person in the audience and says the same thing.\n   There were used to be bathrooms in the buildings and most secrets in the map. However, it was later removed when it was revamped.\nMap History:\n   06/16/19: Added into the game of Arsenal as a private servers-only map.\n   07/05/19: Added to the public rotation.\n   10/04/19: Removed from the public rotation.\n   06/20/20: Revamped and re-added back to the public rotation.\n   06/26/20: Removed from the public rotation.\n   03/16/21: Removed from private servers."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/removedmaps19.JPG",
         "name":"SUBWAY",
         "info":"General Information:\n   Subway is a map that takes place in an underground subway station. Both sides of the map are identical, with multiple rooms and a railing that runs around the map. At the end of each side, there is a hallway that has multiple exits and a ladder that leads to a vent on the second floor. Two trains will go through the middle of the map's railroads at a very fast rate, however only the front of the trains will deal environmental kills. Around the map, there are many barricades, boards, and boxes scattered.\nTips and Tricks:\n   Trains whoosh by as bullets fly everywhere across the map. How do you survive?\n   When the subway trains pass by, use this time to replenish health and reload your weapons. This makes you ready for battle when the trains go away.\n   This may be risky, but from the top floor, jump on top of the subway trains while they are moving and jump on the enemy team.\n   Most of the fighting is in the center of the map, so go up to the second floor to go to the other side of the map without getting hit by trains.\n   While on the second floor, you have the high ground to mow down your enemies.\n   You can shoot through the ramps and the second floor allowing you to get some kills without the enemy expecting it.\n   There are vents just above the second floor on either side of the subway station. Although you don't get a good view from the sides, you can shoot at any enemy players on the second floor and parts of the first. All the while, making you stealthy as people rarely check the vents.\nTrivia:\n   Unlike other moving hazards, only the front of the trains kill you.\n   This map is the 2nd map to be made by AzireBlox that is added into Arsenal, the first being Silo 20.\nMap History:\n   03/25/20: Added into the Post-Showtime! Update of Arsenal.\n   06/26/20: Removed from the public rotation."
      }
   ],
   "murdermaps":[
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/murdermaps1.JPG",
         "name":"OFFICE",
         "info":"General Information: \n   Office is the first map to be added in MURDER. This map takes place around an office complex with parking areas outside of the building during the winter season. There are containers, a ladder and stairways around the map that can lift and leads the player inside the office.\nThere's also a parked van reflected through the window at the terrorists' spawn.\nThis map is taken from Counter Blox."
      },
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/murdermaps2.JPG",
         "name":"AGENCY",
         "info":"General Information: \n Agency is a map originally from Counter-Strike: Global Offensive as a hostage map. It takes place in a commercial penthouse ontop of a skyscraper. The interior is a two-floor office. The first floor has a giant, open lobby with stairs leading up to the second floor, along with two hallways leading to a small cafeteria and a large space. Said large space is overlooked by a balcony.\nOn the second floor, the stairs from the lobby lead into an office space, which connects via an upstairs balcony-way to the main offices. The main offices contains a conference room, a janitor closet, and workspaces.\nAgency has multiple windows on the second-floor main office, though they do not have glass, unlike its origin, Counter Blox. Falling off the map causes the player to lose a level since it is an environmental kill.\nAround the map are several colored balls. The colors of these balls include red, yellow, green, blue, purple, and pink.\n Tips and Tricks:\n   Agency is a map with many rooms, and action happening at every corner. How do you survive?\nThe map is mainly suited for close-quarters, up-close and personal combat.\nExplosive-weapons such as the M16A2 are extremely devastating at close range: With hardly any room to maneuver in such tight space, a single blast could kill multiple players in one shot.\nShotguns also find their niche here, with their capability to fill a narrow, tight space with dozens of pellets in a second.\nIf you climb up the staircase in the room that leads outside, you can find some small openings to shoot through."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/murdermaps3.JPG",
         "name":"MIAMI",
         "info":"General Information:\n Miami is a map in MURDER. This map takes place at night in the Rations Bank in Miami. This map has multiple vents, as tons of small, enclosed areas, numerous of cameras and a opened safe. Most green items will spawn in the main, large area.\n An few of the entrances are blocked by untouchable furniture not to let any players to be difficult to find around the map.\n Trivia:\n   Many assets of the map are taken from other ROLVe projects and VALVe props.\n The map is a recreated version of Miami Heat (cz_miami) from Counter-Strike: Condition Zero: Deleted Scenes.\n A remake of the map was made in 2014 by Shorty from the CS:GO workshop, which can be found here.\n This map was finished on June 6, 2017, two years before MURDER came out.\n Map History:\n   01/13/20: Added into MURDER and updated with;\n Outside is inaccessible.\n More props were added.\n Cabinets can be picked up.\n Vent to bathroom is taller.\n 01/26/20: Miami updated with:\n Added more props around the map, which include various office supplies; some of which may become loot.\n Computer monitors, trash cans, and office chairs can now be picked up.\n Adjusted collision on several prop types.\n Movement in the vents is now quite audible.\n In spectator mode, you can see through all vents now.\n More variety for coffee mugs.\n Attempted to fix glitching through vents.\n Removed some unnecessary background props."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/murdermaps4.JPG",
         "name":"67TH WAY",
         "info":"Map Information:\n   67th Way takes place on a suburban street and contains two tunnels, a big house, a prison, a gun shop, and a building that is under construction.\n Cars occasionally drive along the street at a high speed and can kill players upon any sort of contact with them. If a player is killed by the cars, they likely will be demoted unless an enemy tagged them prior to their death.\n Trivia:\n   This was the first map to have moving obstacles pass through the map that could kill the player. Other maps include Boulevard, Street Corner and Subway.\n As of now, the cars on both directions are currently broken.\n The map is a recreated version of the map with the same name in Garry's Mod.\n There is also a hidden underground bunker and a farm area in the map that can be seen through free-spectating.\n Map History:\n   01/15/19: Added into Arsenal, added clips, and fixed ladders.\n 01/29/19: Changes to 67th Way.\n 02/25/19: Removed from the public rotation.\n 07/05/19: Re-added to the public rotation.\n 10/28/19: Removed from the public rotation."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/murdermaps5.JPG",
         "name":"ROOFTOP",
         "info":"Map Information:\n Rooftop is the fifth map to be added into MURDER in the February update. It is also one of the first maps to be added to MURDER in 2020. It is taken from ROLVe's other game, Typical Colors 2.\n Rooftop takes place in the middle of the night, with two bases and wooden planks connected to a hanging construction bar. Falling into the black abyss below will lead to death. By each base, there is a section beneath divided into two parts, and one has a secret passage way leading to an underground office, with a flight of stairs. Rooftop also has a cellular tower at the very middle, as well as a deactivated middle point. There are RED and GRN signs posted, from the original map in Typical Colors 2. It also has a stairwell by the cellar tower leading to the rooftop of two small buildings.\n Trivia:\n   Rooftop is the second night-time map to be added into MURDER.\n This map is a recreated version of Team Fortress 2 custom map, koth_rooftop created by JT.\n Map History:\n   02/24/20: Added into the game of MURDER."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/murdermaps6.JPG",
         "name":"ASSAULT",
         "info":"Map Information:\n Assault is a recreated version of the popular CS:GO and CS Source map known as: cs_assault. It takes place around an industrial warehouse, with access to the area being blocked off. It's separated into 5 distinct parts, the train station, the warehouse on the left side of the map, the two parallel streets next to them, and the long street that connects the warehouse and the parallel streets.\n The Warehouse has an upper section and a lower section. The upper section has a door in the back that leads to one of the parallel streets, and there is also a door in the lower section that leads to the same street. There is a larger warehouse door that leads to the long street.\n The Train Station is positioned above the rest of the landmarks, making it a good place to camp.\n The two parallel streets just lead onto the main connecting road. People will spawn at the end of these roads, so it's nice to dip around and shoot some of them. The two parallel roads are connected by a small alleyway that houses a few trash bags and broken cars.\n The main street connects all of the previous landmarks. You can enter the warehouse, go onto either of the two parallel streets and walk up to the train station. There aren't any decent barricades on this street, and makes you slightly easier to hit.\n Tips and Tricks:\n   A map straighter than a railgun shot, choked by a small garage, accented by a stocked warehouse, and tied into a knot of endless firefight with the trademark train station, Assault is a map that has two simple states of combat: constant straight shooting chaos, or hilariously one-sided vantage pushes. Considering that most matches in Arsenal aren't that coordinated, you can count on the first happening most of the time.\n Many weapons that have tight spread and good accuracy are extremely powerful in this map due to the amount of open space and straight sightlines. Snipers are also considerably more useful than normal thanks to this, allowing potentially awful weapons such as the M40 and MS556 to become somewhat easier to get past.\n Common spawns are in the warehouse, at the end of the streets, and near the stairs that lead to the top of the train station. The warehouse spawn is one you'll want to target often as there is little chance for interruption thanks to it being a closed space. You'll likely snag several kills if you place your shots right as most would be expecting the enemy to come from outside the warehouse, so get flanking!\n Rocket/recoil jumping poses a large advantage, going quickly from one side of the map to another. This becomes much more useful when you reach the roof of the garage, as it not only covers the roof of the warehouse, but pretty much every other part of the map aside from inside the warehouse. You can also access the train station roof, a more niche spot due to it making you a bigger target than Hackula, but somewhat useful as well. It's got a nice view, after all.\n Spawncamps are really prevalent and easy to perform in this map, especially on the street spawns. These spawns have ZERO protection, so whoever spawns there will fall victim to anybody aiming in the general direction of them. If you happen to see someone pop into existence in that general area, raise hell.\n Knifing in general on this map is pretty painful, thanks to how open it is. The only remotely viable spots to even attempt it is in the warehouse, garage, and the stairs up to the train station. Even then, it's really easy to get any of your tries to demote your foes shot down. This makes the Golden Knife difficult to kill with, as you have to hope and pray that an opponent will be lined up in what would essentially be a perfect spot. Try to go for the good knife spots, or just camp around and challenge a knife fight in the warehouse if you're feeling chicken.\n Trivia:\n   The map begun its development on May 26th, 2018.\n The map can be played here.\n In the 2.4 Update, the map was changed to be forced on 2 teams.\n However, on 02/13/20, this was reverted back and remains like that to this day.\n Map History:\n   01/15/19: Added into the game of Arsenal.\n 01/29/19: Changes to Assault.\n 02/01/19: Assault is forced on 2 teams.\n 02/13/19: Assault is now free to 4 teams and FFA.\n 05/31/19: Fixed vent collision and box spawn.\n 06/05/19: 2 collision fixes for Assault.\n 06/06/19: Adjusted lighting to Assault.\n 06/09/19: OOB fixes to Assault.\n 09/01/19: Fixed collision on the tracks.\n 11/19/19: Icon updated.\n 08/15/20: Fixed the blue box."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/murdermaps7.JPG",
         "name":"BOULEVARD",
         "info":"Map Information:\n   Boulevard is a map released in the 2.5 update. It's a very large and spacey map that favors long-ranged weapons such as snipers, or perfectly accurate weapons. However, it does provide some areas where you can confront enemies in closer ranged combat, so inaccurate weapons are not completely useless.\n Boulevard takes place in a residential suburban city with multiple shops.\n The map features many places to go into. These things include a track where a trolley comes to run over anyone in its path, resulting in a demotion (you can hear it coming by its ringing sound); a gas station called Scoobies; a coffee shop called Stinky is; a juice store called Stink Juice; and multiple vehicles scattered around the area.\n The small buildings have nice rooms that overlook the main road and gas station. As long as the area is secured with a small team, domination is essentially guaranteed. However, retaliating players may simply counter-snipe or use explosives to dislodge you.\n Tips and Tricks:\n   Boulevard is a very open map with action in specific areas. How do you win?\n If you have shotguns or high spread automatics, these are your best friends at the gas station, parking lot, and inside the buildings.\n If you happen to have a weapon with the Rocket/Shotgun Jumping ability, use this to your advantage to hide on top of buildings to mow your enemies down below.\n The spawn locations on this map can give you and your team a great opportunity to corner the enemy.\n The trolley can be easily avoided because of its distinctive sound, however, this does not mean to always stay at its path.\n Scoped weapons such as the Barrett or the G11 can be easily used for picking off enemies at longer ranges.\n The Golden Knife is arguably the best or worst in situations. For flanking, either go behind the office buildings or behind Stinky's Coffee shop.\n The skin Froggy is obtainable here by killing 5 people near a frog. The frog will get bigger and bigger until it will start hopping to get the skin. You have to follow it and it will lead you to a door with wood on it. You have to break that wood and when you're finished breaking it, it will teleport you to a different server with a different map, the Apartment. You will see a stand with moving animals on it. You have to shoot all the animals except the frog until confetti comes out of the stand, and that means you got the Froggy skin\n You can get the unusual Froggy skin by doing the Froggy quest normally, but you have to time the Frog and the train to make them collide.\n Trivia:\n   The gas station, Scoobies is a reference to the mispronunciation of Scoobis, created by zKevin. The gas station store (Biggie Mart) even has a Scoobies easter-egg in one of the fridges.\n One of the gas pumps has Roblox studio is loading written on it, which may or may have not happened because a certain viewer gave a suggestion.\n The gas station was previously named Milo, and had a picture of Milo. It had to be changed as it is currently a picture of a duck with oops under it.\n as of 07/5/2019, it has been changed to a low-quality image of a yellow car.\n Scapter's Wizard hat is seen on a dumpster near the gas station, this appeared after his account got deleted.\n You can find Kevin from Ed Edd N' Eddy in the juice store.\n There is a pair of binoculars on top of the brick building in between Scoobies & Stinky's Coffee.\n You can find Stinky's Coffee cups around the map.\n The background buildings are based on buildings in San Francisco's Fillmore district.\n TC has his name on a computer screen in the bookstore.\n During the development live stream, it was a picture of a Robloxian in a gray sweater, and black pants wearing a top hat holding a radio saying I shall rain hellfire upon everyone., this was removed.\n This map's development was also streamed, much like Hillside.\n The sign at Stinky's Coffee shows it has a drive-thru, and it's stylized as a 'Drive-and-wait-for-15-minutes-thru'.\n On the map, StinkBooks is having a special offer: buy one, get none.\n During the development of this, TC was searching for an image of a trolley and Redacted By TCTully's special cowboy agency.\n Boulevard currently holds the Froggy quest.\n The time between a tram passing through boulevard varies. Anywhere from 10-15 seconds to 2+ minutes.\n Map History:\n   02/14/19: Added into the 2.5 Update of Arsenal.\n 02/15/19: Changes to Boulevard.\n 06/21/20: Added a frog as a part of the Froggy quest.\n 10/29/20: Added the Froggy unusual steps."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/murdermaps8.JPG",
         "name":"BANK",
         "info":"Map Information:\n Bank is a legacy map from Pre-Filtering Enabled Arsenal.\n This map is a replica of the de_bank map from Counter-Strike: Global Offensive. It was removed from the Arsenal map rotation in mid-2016.\n The map features the main bank, which is having restorations, because of this, there is a ladder to the top of the building. Inside the bank, there is a lobby that features little decor. Next to the bank, there is a industrial building with a truck that has skidded off course. There are other buildings on the opposite side.\n Trivia:\n   The teller's desk is supposed to be facing the right wall in the Counter-Strike: Global Offensive version.\n This is the third map to not be exclusive to private servers after their removal, first being Canyon, second being de_vertigo, fourth being Aztec, fifth being Delta (before the revamp), sixth being Nuke Bunker, seventh being the original Safehouse.\n Map History:\n   02/09/16: Added into Gun Game.\n 04/21/16: Taken to the ALPHA phase of Arsenal.\n 04/25/16: Removed from Arsenal."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/murdermaps9.JPG",
         "name":"NUKE",
         "info":"Map Information:\n Nuke is a map exclusive to MURDER that is based off of the map from the Counter-Strike Franchise named de_nuke. The map takes place in the ROLVe Creek Nuclear Power Plant. There are multiple silos and boxes scattered around the map. Inside the power plant, there is bombsite A. On the bottom floor, there is bombsite B. There are multiple interactive canned goods around the map, such as tomato soup, Bloxiade, and Bloxy Cola.\n Trivia:\n   The only difference between this version and the Counter Blox's version is that there's a bunker hatch and two more props in the ladder room.\n This map was made by the most amount of developers; 7.\n There is a easter egg that can be found in spectator mode and it shows two pictures and the names of the users who created the map."
      },
	  {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/murdermaps10.JPG",
         "name":"ITALY",
         "info":"General Information:\n   Italy is a MURDER map that was released on 05/14/20. This map takes place at daytime inside a village.\n The village contains some accessible buildings, with one of them having a basement. There are also some narrow passageways between each buildings or between the wall and a building, leading to the market. Near the entrance of Italy, there are paths to take the second floor. Loot is usually spotted easy and hard to find in this map due to boxes being big and some waste being small.\n Trivia:\n   This is the second murder map to be based on a real-life location.\n This is based on map of the same name from CS:GO.\n Map History:\n   05/15/20: Added into MURDER."
      }
   ]
}
