{
   "currentmaps":[
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/currentmap1.JPG",
         "name":"SANDTOWN",
         "info":"General Information:\n   Sandtown is a standard map in Arsenal. The map takes place in a Middle Eastern market district. It is the second smallest map in the game, with Bridge being the smallest.\nThere are planks connecting buildings and roofs to buildings. On ground level, it features a fountain in the heart of the map, narrow pathways leading the buildings, and a wide and open space, making it not much of a hassle to find the action. It also features a little shack containing hay, ways to get up to the buildings as mentioned earlier, and the carpeted inside of the buildings.\nShortly after the start of a round on this map, a scripted event occurs in which a plane crashes into the tallest building on the map, with its right wing falling off and bridging the balcony near the bottom of the building with a nearby staircase. The plane can then be reached by Rocket/Recoil Jumping.\nOn the other two buildings, they have a metallic plank (aka. the plane's wing) connecting them, and a staircase leading up to one of them. Also, it features a stone arch which leads to another part of the map where there is a little plank leading to the other side, a way into one of the carpeted buildings, and more. One spawn point is wide open to players ready to shoot at you.\nThere all sorts of chokepoints, including the area underneath the crashed airplane to the left rooftop of the building left of the wires.\n Tips and Tricks: \n    Sandtown, being one of the smallest maps in the game, means there will always be a firefight somewhere on the map, no exceptions. With constantly shifting spawns, bullets flying from every corner, this map promises never-ending action gameplay.\nSpawns are likely to shift at any given moment and pay attention to where your teammates are heading and figure out where the enemy is going to come from next.\nWhile heights are often a huge advantage in other maps, in Sandtown, it is relevant. The small map size means that the enemy could come from anywhere. The only option is to stay on your toes and eliminate anybody who crosses your path.\nExplosives and shotguns are useful on this map. Enemies are likely to press their faces against the camera or bunch up constantly, so take advantage of those situations!\nThe plane is a viable camping spot, but as stated before, you're likely to either fall behind or get picked off.\nYou can walk on the clotheslines by platforming on the arch near the building spawn. While it might not be too useful, since it leaves you open, it's good if your opponents are focused on where your teammates are. Flank them and secure kills.\nThe Golden Knife is extremely dangerous in this map, since the wielder can quite literally jump from anywhere with its double jump capability. It has many parkour queues. If you happen to get your hands on it, platform onto a higher spot and get the drop on an unsuspecting enemy. Preferably, a rooftop.\nThe middle of the map is usually where the fights go on play, go seek for higher heights to not be part of it.\nThe building that looks over the entire center of the map can easily be ambushed if you fail to keep track of the stairs. Check the route on the side to quickly deal with flankers."
      },
      {
         "image":"https://github.com/AnhPhamRepository/RobloxMaps/blob/master/currentmap2.JPG",
         "name":"SAFEHOUSE",
         "info":"Map Information: \n   Safehouse takes place in a hilly woodland area with a craftsman styled house as the focal point. The map is inspired by the CS:GO map, de_safehouse, but has a different layout outside of the house.\nMultiple rocks, rocky terrain, and trees make it a extremely dynamic map, providing natural cover or vantage points. A cobblestone wall blocks the two sides of the map, however there are some ways around it, with there being a shed that you can climb over to get to the other side, and a 2 planks on the other. \n Tips and Tricks: \n Safehouse is the most straight forward map of all of the maps. With an open spawn area and a closed house area, a skirmish is likely always happening on this map.\nMost players will try to get as many kills as possible going through the main hallway and the kitchen. If you want to get the drop on them, go through one of the windows and flank.\nThe roof is a very strong vantage point, especially if the enemy is spawning in the lower spawns. If you get there, exploit it to its fullest potential.\nIf you want to avoid the house in its entirety, go to the walls and use the planks to flank the enemy.\nThe lower spawn is possibly the worst area to be in on this map. It is, quite literally, an uphill battle from there. Work with your team to push and regain the upper spawn, then turn the tables!\nThe stairs are a nice section to camp on if the enemy is spawning from the upper spawns. Since most of them will be looking down the hallway, pick off any unfortunate souls, then book it once you start getting shot at.\nThe roof, the trees, and the large window on upper-spawn side of the house can be used to get the drop on anybody walking into the hallway. This is especially useful when you're on the Golden Knife.\nWhich is that you're likely to have a hard time getting a kill on this map unless the person you're chasing is inside the house. Use any of the flank routes mentioned above, and win!"
      }
   ],
   "brickbattlemaps":[
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/brickbattlemaps1.JPG",
         "name":"BLOXBURG",
         "info":"Map Information: \n    Bloxburg was a map that is in the Brickbattle gamemode. It was featured in the original ROBLOX Battle and was created by Games. This map takes place in a city and a plaza. Much like many other Brickbattle maps, some of the parts can be blown up by explosives.\nThis map was removed from Arsenal along with Brickbattle gamemode in Halloween Update.\n Map History: \n    01/11/19: Added into Arsenal.\n02/09/19: Accidentally removed from Arsenal.\n02/16/19: Re-added back to the game of Arsenal.\n10/24/19: Removed from the public rotation."
      },
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/brickbattlemaps2.JPG",
         "name":"CROSSROADS",
         "info":"Map Information:\n    Crossroads is a map in the BrickBattle gamemode. Many parts of the map can be blown up by explosives. It is based on a former popular ROBLOX game of the same name developed by early ROBLOX staffs. Initially, all of the spawn points and a few structures from the map were removed for Arsenal.\nThis map was removed from Arsenal along with Brickbattle game mode in Halloween Update.\n    Map History: \n 01/11/19: Added into Arsenal.\n02/09/19: Accidentally removed from Arsenal.\n02/16/19: Re-added back to the game of Arsenal.\n10/24/19: Removed from the public rotation."
      },
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/brickbattlemaps3.JPG",
         "name":"CHAOS CANYON",
         "info":"Map Information:\n Chaos Canyon is a map featured in the Brickbattle gamemode. It was created by Shedletsky and community members in 2007. It was used for a Brickbattle type game on the ROBLOX profile. The map takes place on a canyon called Desolation Valley, there's thin walls, a bunker, a exterior-column and two specific towers. Much like many other Brickbattle maps, some of the parts can be blown up by explosives.\nThis map was removed from Arsenal along with Brickbattle gamemode in Halloween Update.\n Map History:\n   01/11/19: Added into Arsenal.\n02/09/19: Accidentally removed from Arsenal.\n02/16/19: Re-added back to the game of Arsenal.\n10/24/19: Removed from the public rotation."
      }
   ],
   "reskinnedmaps":[
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/reskinnedmaps1.JPG",
         "name":"HEIGHT FRIGHTS",
         "info":"General Information:\n   Height Frights takes place in an open-ended map set in a theme park surrounded by a castle at dawn. Areas mix of long to close-ranged combat with most encounters near the drop tower & gamer grill stalls.\nHeight Frights features one roller coaster, two flat rides, and a couple more shop & game stalls.\n Tips and Tricks:\n   There are many high vantage points. These include:\nThe Ferris wheel, the most used, the easiest, and most useful vantage point to use, as hiding in the car not only shields you from damage, but it also gives you a nice view, allowing you to fire upon any unsuspecting players.\nAny and all of the roofs present on the map.\nThe top of the dropping machine ride, the highest point on the map.\nThe trees, not commonly used but still useful nonetheless.\nThis map is very open, making snipers and straight-shooting weapons ideal. Weapons that can boost jump are also especially useful considering the many height vantages.\nThe top of the dropping machine is the highest point in the map, making it useful for sniping, but not ideal for other weapons. It's hard enough to get there anyway, so stick to other spots. Unless you want to meme or pick off enemies from longer ranges, then go for it.\nThe roller coaster is a strange feature of the map. You'll likely not hit any of the enemies while on it, but they likely won't hit you either. Getting hit by the roller coaster will count as an environmental death and will likely demote you. Note that if you exit the roller coaster while the roller coaster is still moving you will be demoted.\nYou'll have a particularly hard time securing a kill with the Golden Knife in most situations on this map. Try to take alternative routes or drop from a high place to give yourself the best bet at winning.\nFlanking is practically impossible, so you would have to rely on direct combat. Weapons that have a good movement speed to get to the front line faster with straight-forward shooting like the MP9-S will strive well."
      },
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/reskinnedmaps2.JPG",
         "name":"SAFEHOUSE",
         "info":"Map Information:\n Safehouse takes place in a hilly woodland area with a craftsman styled house as the focal point. The map is inspired by the CS:GO map, de_safehouse, but has a different layout outside of the house.\nMultiple rocks, rocky terrain, and trees make it a extremely dynamic map, providing natural cover or vantage points. A cobblestone wall blocks the two sides of the map, however there are some ways around it, with there being a shed that you can climb over to get to the other side, and a 2 planks on the other.\n Tips and Tricks:\n   Safehouse is the most straight forward map of all of the maps. With an open spawn area and a closed house area, a skirmish is likely always happening on this map.\nMost players will try to get as many kills as possible going through the main hallway and the kitchen. If you want to get the drop on them, go through one of the windows and flank.\nThe roof is a very strong vantage point, especially if the enemy is spawning in the lower spawns. If you get there, exploit it to its fullest potential.\nIf you want to avoid the house in its entirety, go to the walls and use the planks to flank the enemy.\nThe lower spawn is possibly the worst area to be in on this map. It is, quite literally, an uphill battle from there. Work with your team to push and regain the upper spawn, then turn the tables!\nThe stairs are a nice section to camp on if the enemy is spawning from the upper spawns. Since most of them will be looking down the hallway, pick off any unfortunate souls, then book it once you start getting shot at.\nThe roof, the trees, and the large window on upper-spawn side of the house can be used to get the drop on anybody walking into the hallway. This is especially useful when you're on the Golden Knife.\nWhich is that you're likely to have a hard time getting a kill on this map unless the person you're chasing is inside the house. Use any of the flank routes mentioned above, and win!"
      }
   ],
   "removedmaps":[
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/removedmaps1.JPG",
         "name":"EASTERN",
         "info":"Map Information: \n Eastern is a legacy map from Pre-Filtering Enabled Arsenal. It was removed from Arsenal in early 2016, but was added back as a private server-exclusive map later on for the revamp of Arsenal.\nBoth teams spawn on opposites of the map and clash in this long corridor type map. The entire map seems to take place in an apocalyptic highway or road. The middle area has some ladders, scaffolding, platforms, fences and road barriers while the red and blue areas have mini blocky buildings and burning, destroyed cars. Also throughout the map, there are arches with cones on the top of them."
      },
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/removedmaps2.JPG",
         "name":"BANK",
         "info":"Map Information:\n Bank is a legacy map from Pre-Filtering Enabled Arsenal.\nThis map is a replica of the de_bank map from Counter-Strike: Global Offensive. It was removed from the Arsenal map rotation in mid-2016.\nThe map features the main bank, which is having restorations, because of this, there is a ladder to the top of the building. Inside the bank, there is a lobby that features little decor. Next to the bank, there is a industrial building with a truck that has skidded off course. There are other buildings on the opposite side."
      }
   ],
   "murdermaps":[
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/murdermaps1.JPG",
         "name":"OFFICE",
         "info":"General Information: \n   Office is the first map to be added in MURDER. This map takes place around an office complex with parking areas outside of the building during the winter season. There are containers, a ladder and stairways around the map that can lift and leads the player inside the office.\nThere's also a parked van reflected through the window at the terrorists' spawn.\nThis map is taken from Counter Blox."
      },
      {
         "image":"https://raw.githubusercontent.com/AnhPhamRepository/RobloxMaps/master/murdermaps1.JPG",
         "name":"AGENCY",
         "info":"General Information: \n Agency is a map originally from Counter-Strike: Global Offensive as a hostage map. It takes place in a commercial penthouse ontop of a skyscraper. The interior is a two-floor office. The first floor has a giant, open lobby with stairs leading up to the second floor, along with two hallways leading to a small cafeteria and a large space. Said large space is overlooked by a balcony.\nOn the second floor, the stairs from the lobby lead into an office space, which connects via an upstairs balcony-way to the main offices. The main offices contains a conference room, a janitor closet, and workspaces.\nAgency has multiple windows on the second-floor main office, though they do not have glass, unlike its origin, Counter Blox. Falling off the map causes the player to lose a level since it is an environmental kill.\nAround the map are several colored balls. The colors of these balls include red, yellow, green, blue, purple, and pink.\n Tips and Tricks:\n   Agency is a map with many rooms, and action happening at every corner. How do you survive?\nThe map is mainly suited for close-quarters, up-close and personal combat.\nExplosive-weapons such as the M16A2 are extremely devastating at close range: With hardly any room to maneuver in such tight space, a single blast could kill multiple players in one shot.\nShotguns also find their niche here, with their capability to fill a narrow, tight space with dozens of pellets in a second.\nIf you climb up the staircase in the room that leads outside, you can find some small openings to shoot through."
      }
   ]
}